content/c/books/apue-notes.org
# -*- coding:utf-8-*-
#+TITLE: 《UNIX 高级环境编程（第三版）》笔记
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com
#+STARTUP: overview
#+OPTIONS: num:nil

* 第一章 UNIX 基础知识
** 1.2 UNIX 体系结构
   操作系统是一种软件，它控制计算机硬件资源，提供程序运行环境。我们称之为“内核（kernel）”。

   内核的接口称之为系统调用（system call）。公用函数库构建在系统调用接口之上，应用程序既可以调用系统调用，也可以调用公用函数库。

   理解：系统调用是最底层的功能，公用函数库是对系统调用的封装，借以简化特定功能。

   shell 是一个特殊的 *应用程序* ，为运行其他应用程序提供了一个接口。

   理解：shell 提供了交互的功能，如果没有 shell，也没图形界面的话，其他应用程序可能无法手动调用。
** 1.4 文件和目录
   UNIX 文件系统的大多数实现并不在目录项中存放属性，这是因为当一个文件具有多个硬链接时，很难保持多个属性副本之间的同步。（理解这段话？）
** 1.6 程序和进程
