c/books/apue-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-25 三 16:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>《UNIX 高级环境编程（第三版）》笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">《UNIX 高级环境编程（第三版）》笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6fad20b">第一章 UNIX 基础知识</a>
<ul>
<li><a href="#org998fdb2">1.2 UNIX 体系结构</a></li>
<li><a href="#org10a8538">1.4 文件和目录</a></li>
<li><a href="#orgf9b0b00">1.6 程序和进程</a>
<ul>
<li><a href="#org6a0dbfd">fork</a></li>
<li><a href="#org72aee00">execve</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge0cc005">第七章 进程环境</a></li>
<li><a href="#org00b84aa">第八章 进程控制</a></li>
<li><a href="#orgef02b7b">第九章 进程关系</a></li>
<li><a href="#orgdd4717b">第十章 信号</a>
<ul>
<li><a href="#org55176c6">引言</a></li>
<li><a href="#org828787e">信号概念</a></li>
<li><a href="#org86bc668">函数 signal</a></li>
<li><a href="#org1f7b8b0">不可靠的信号</a></li>
<li><a href="#orgdcbcfd0">中断的系统调用</a></li>
<li><a href="#orgffbad77">可重入函数</a></li>
<li><a href="#org277492a">SIGCLD 语义</a></li>
<li><a href="#org9978b5f">可靠信号术语和语义</a></li>
<li><a href="#org21cac78">函数 kill 和 raise</a></li>
<li><a href="#orgc951cb0">函数 alerm 和 pause</a></li>
<li><a href="#org12cf1e5">信号集</a></li>
<li><a href="#org2bbe3cb">函数 sigprocmask</a></li>
<li><a href="#org7b4bb9e">函数 sigpending</a></li>
<li><a href="#org7301f15">函数 sigaction</a></li>
<li><a href="#org657be25">函数 sigsetjump 和 siglongjmp</a></li>
<li><a href="#org1236761">函数 sigsuspend</a></li>
<li><a href="#org57ba4c3">函数 abort</a></li>
<li><a href="#org7346267">函数 system</a></li>
<li><a href="#org7a35908">函数 sleep、nanosleep、和 <code>clock_nanosleep</code></a></li>
<li><a href="#org8bf14cd">函数 sigqueue</a></li>
<li><a href="#org98da2ce">作业控制信号</a></li>
<li><a href="#org2a94c9b">信号名和编号</a></li>
</ul>
</li>
<li><a href="#orgdbb783f">第十一章 线程</a>
<ul>
<li><a href="#org72c8f28">11.2 线程概念</a></li>
<li><a href="#org88926bd">11.3 线程标识</a></li>
<li><a href="#org558b639">11.4 线程创建</a></li>
<li><a href="#orga8d379d">11.5 线程终止</a></li>
<li><a href="#org9d76110">11.6 线程同步</a>
<ul>
<li><a href="#org525a9a9">11.6.1 互斥量（mutex）</a></li>
<li><a href="#org5650de1">11.6.2 避免死锁</a></li>
<li><a href="#orgc233424">11.6.4 读写锁</a></li>
<li><a href="#org701799a">11.6.6 条件变量（condition）</a></li>
<li><a href="#org289e57f">11.6.7 自旋锁（spin lock）</a></li>
<li><a href="#orgfc31d6b">11.6.8 屏障（barrier）</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6f67e7f">第十二章 线程控制</a>
<ul>
<li><a href="#org62ea33e">12.2 线程属性</a></li>
<li><a href="#orga6d8f7c">12.4 同步属性</a>
<ul>
<li><a href="#org0a68e8c">12.4.1 互斥量属性</a>
<ul>
<li><a href="#orge7eb1c2">共享属性</a></li>
<li><a href="#orgfa9c027">健壮属性</a></li>
<li><a href="#orgf9bf31a">类型属性</a></li>
</ul>
</li>
<li><a href="#org01a6ddc">12.4.2 读写锁属性</a></li>
<li><a href="#org0ff620c">12.4.3 条件变量属性</a></li>
<li><a href="#orga65555b">12.4.4 屏障属性</a></li>
</ul>
</li>
<li><a href="#org68c87b0">12.5 重入</a></li>
<li><a href="#org3da03a6">12.6 线程特定数据</a></li>
<li><a href="#org80d47f8">12.7 取消选项</a></li>
<li><a href="#orgd0cef35">12.8 线程和信号</a></li>
<li><a href="#org29654b6">12.9 线程和 fork</a></li>
<li><a href="#orgb5c5e0f">12.10 线程和 I/O</a></li>
</ul>
</li>
<li><a href="#org175582a">第十三章 守护进程</a></li>
<li><a href="#orgb303825">第十四章 高级 I/O</a>
<ul>
<li><a href="#org1c8c087">引言</a></li>
<li><a href="#orge2bd903">非阻塞 I/O</a></li>
<li><a href="#org26af2c7">记录锁</a></li>
<li><a href="#org762a8fb">I/O 多路转接</a></li>
<li><a href="#orgc39f22d">异步 I/O</a></li>
<li><a href="#org53dc29b">函数 readv 和 writev</a></li>
<li><a href="#org6c262d5">函数 readn 和 writen</a></li>
<li><a href="#orgf5cad40">存储映射 I/O</a></li>
</ul>
</li>
<li><a href="#orgf9e11fa">第十五章 进程间通信</a>
<ul>
<li><a href="#orga997df7">管道</a></li>
<li><a href="#orgc13ccc6">函数 popen 和 pclose</a></li>
<li><a href="#org9d04653">协同进程</a></li>
<li><a href="#org3b5307d">FIFO</a></li>
<li><a href="#org57f68b9">XSI IPC</a></li>
<li><a href="#orgee1e7c6">消息队列</a></li>
<li><a href="#orgcea994e">信号量</a></li>
<li><a href="#org7f23a6f">共享存储</a></li>
<li><a href="#org05b06f7">POSIX 信号量</a></li>
<li><a href="#org3a36a38">客户进程-服务器进程属性</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6fad20b" class="outline-2">
<h2 id="org6fad20b">第一章 UNIX 基础知识</h2>
<div class="outline-text-2" id="text-org6fad20b">
</div>
<div id="outline-container-org998fdb2" class="outline-3">
<h3 id="org998fdb2">1.2 UNIX 体系结构</h3>
<div class="outline-text-3" id="text-org998fdb2">
<p>
操作系统是一种软件，它控制计算机硬件资源，提供程序运行环境。我们称之为“内核（kernel）”。
</p>

<p>
内核的接口称之为系统调用（system call）。公用函数库构建在系统调用接口之上，应用程序既可以调用系统调用，也可以调用公用函数库。
</p>

<p>
理解：系统调用是最底层的功能，公用函数库是对系统调用的封装，借以简化特定功能。
</p>

<p>
shell 是一个特殊的 <b>应用程序</b> ，为运行其他应用程序提供了一个接口。
</p>

<p>
理解：shell 提供了交互的功能，如果没有 shell，也没图形界面的话，其他应用程序可能无法手动调用。
</p>
</div>
</div>
<div id="outline-container-org10a8538" class="outline-3">
<h3 id="org10a8538">1.4 文件和目录</h3>
<div class="outline-text-3" id="text-org10a8538">
<p>
UNIX 文件系统的大多数实现并不在目录项中存放属性，这是因为当一个文件具有多个硬链接时，很难保持多个属性副本之间的同步。（理解这段话？）
</p>
</div>
</div>
