content/c/books/apue-notes.org
*** fork
    The fork() function shall create a new process. The new process (child process) shall be an exact copy of the calling process (parent process) except as detailed below:

    fork（）函数将创建一个新进程。新进程（子进程）应该是调用进程（父进程）的精确副本，但以下说明除外：

    + The child process shall have a unique process ID.

      子进程应具有唯一的进程 ID。

    + The child process ID also shall not match any active process group ID.

      子进程 ID 也不能与任何活动进程组 ID 相匹配。

    + The child process shall have a different parent process ID, which shall be the process ID of the calling process.

      子进程应该有一个不同的父进程 ID，它应该是调用进程的进程 ID。

    + The child process shall have its own copy of the parent's file descriptors. Each of the child's file descriptors shall refer to the same open file description with the corresponding file descriptor of the parent.

      子进程应拥有自己父文件描述符的副本。每个子进程的文件描述符都应指向与父对应文件描述符相同的打开文件描述。

    + The child process shall have its own copy of the parent's open directory streams. Each open directory stream in the child process may share directory stream positioning with the corresponding directory stream of the parent.

      子进程应拥有自己父开放目录流的副本。子进程中的每个打开的目录流可以与父对应的目录流共享目录流定位。

    + The child process shall have its own copy of the parent's message catalog descriptors.

      子进程应拥有自己父进程的消息目录描述符的副本。

    + The child process' values of tms_utime, tms_stime, tms_cutime, and tms_cstime shall be set to 0.

      子进程的 tms_utime，tms_stime，tms_cutime 和 tms_cstime 的值应设置为 0。

    + The time left until an alarm clock signal shall be reset to zero, and the alarm, if any, shall be canceled; see alarm().

      alarm clock 信号应剩余时间重置为零，并且如果有 alarm 的话，应取消。

    + All semadj values shall be cleared.

      所有 semadj 值都应清除。

    + File locks set by the parent process shall not be inherited by the child process.

      父进程设置的文件锁不应由子进程继承。

    + The set of signals pending for the child process shall be initialized to the empty set.

      子进程挂起的信号集初始化为空集。

    + Interval timers shall be reset in the child process.

      间隔计时器应在子进程中重置。

    + Any semaphores that are open in the parent process shall also be open in the child process.

      任何在父进程中打开的信号量也应该在子进程中打开。

    + The child process shall not inherit any address space memory locks established by the parent process via calls to mlockall() or mlock().

      子进程不应继承由父进程通过调用 mlockall（）或 mlock（）建立的任何地址空间内存锁。

    + Memory mappings created in the parent shall be retained in the child process. MAP_PRIVATE mappings inherited from the parent shall also be MAP_PRIVATE mappings in the child, and any modifications to the data in these mappings made by the parent prior to calling fork() shall be visible to the child. Any modifications to the data in MAP_PRIVATE mappings made by the parent after fork() returns shall be visible only to the parent. Modifications to the data in MAP_PRIVATE mappings made by the child shall be visible only to the child.

    在父进程中创建的内存映射应保留在子进程中。从父级继承的 MAP_PRIVATE 映射也应该是子进程中的 MAP_PRIVATE 映射，父进程中在调用 fork（）之前对这些映射中的数据所做的任何修改都应该对子级可见。在 fork（）返回后由父级所做的对 MAP_PRIVATE 映射中的数据的任何修改应仅对父级可见。子进程对 MAP_PRIVATE 映射中做的数据修改只能由子进程看到。

    + For the SCHED_FIFO and SCHED_RR scheduling policies, the child process shall inherit the policy and priority settings of the parent process during a fork() function. For other scheduling policies, the policy and priority settings on fork() are implementation-defined.

      对于 SCHED_FIFO 和 SCHED_RR 调度策略，子进程应在 fork（）函数期间继承父进程的策略和优先级设置。对于其他调度策略，fork（）上的策略和优先级设置是实现定义的。

    + Per-process timers created by the parent shall not be inherited by the child process.

      父进程创建的进程定时器不应该被子进程继承。

    + The child process shall have its own copy of the message queue descriptors of the parent. Each of the message descriptors of the child shall refer to the same open message queue description as the corresponding message descriptor of the parent.

      子进程应拥有自己的父进程的消息队列描述符的副本。每个子进程的消息描述符应该指向与父对应消息描述符相同的开放消息队列描述。

    + No asynchronous input or asynchronous output operations shall be inherited by the child process.

      子进程不应继承异步输入或异步输出操作。

    + A process shall be created with a single thread. If a multi-threaded process calls fork(), the new process shall contain a replica of the calling thread and its entire address space, possibly including the states of mutexes and other resources. Consequently, to avoid errors, the child process may only execute async-signal-safe operations until such time as one of the exec functions is called. Fork handlers may be established by means of the pthread_atfork() function in order to maintain application invariants across fork() calls.
      父进程应该是单线程。如果多线程进程调用 fork（），则新进程应包含调用线程的副本及其整个地址空间，可能包括互斥锁和其他资源的状态。因此，为避免错误，子进程可能只会执行异步信号安全操作，直到调用其中一个 exec 函数为止。可以通过 pthread_atfork（）函数建立 fork 处理程序，以便跨 fork（）调用维护应用程序不变量。

      When the application calls fork() from a signal handler and any of the fork handlers registered by pthread_atfork() calls a function that is not asynch-signal-safe, the behavior is undefined.

      当应用程序从信号处理程序调用 fork（）并且由 pthread_atfork（）注册的任何 fork 处理程序调用不是异步信号安全的函数时，行为是未定义的。

    + If the Trace option and the Trace Inherit option are both supported:

      如果跟踪选项和跟踪继承选项都支持：

      + If the calling process was being traced in a trace stream that had its inheritance policy set to POSIX_TRACE_INHERITED, the child process shall be traced into that trace stream, and the child process shall inherit the parent's mapping of trace event names to trace event type identifiers. If the trace stream in which the calling process was being traced had its inheritance policy set to POSIX_TRACE_CLOSE_FOR_CHILD, the child process shall not be traced into that trace stream. The inheritance policy is set by a call to the posix_trace_attr_setinherited() function.

        如果调用进程在其继承策略设置为 POSIX_TRACE_INHERITED 的跟踪流中进行跟踪，则应将子进程跟踪到该跟踪流中，并且子进程应继承父进程的跟踪事件名称映射以跟踪事件类型标识符。如果跟踪调用进程的跟踪流将其继承策略设置为 POSIX_TRACE_CLOSE_FOR_CHILD，则不应将子进程跟踪到该跟踪流中。继承策略通过调用 posix_trace_attr_setinherited（）函数来设置。

    + If the Trace option is supported, but the Trace Inherit option is not supported:

      如果支持 Trace 选项，但不支持 Trace Inherit 选项：

      + The child process shall not be traced into any of the trace streams of its parent process.

        子进程不应追溯到其父进程的任何跟踪流中。

    + If the Trace option is supported, the child process of a trace controller process shall not control the trace streams controlled by its parent process.

      如果支持跟踪选项，则跟踪控制器进程的子进程不应控制由其父进程控制的跟踪流。

    + The initial value of the CPU-time clock of the child process shall be set to zero.

      子进程的 CPU 时间时钟的初始值应设置为零。

    + The initial value of the CPU-time clock of the single thread of the child process shall be set to zero.

      子进程的单线程的 CPU 时钟的初始值应设置为零。

    All other process characteristics defined by IEEE Std 1003.1-2001 shall be the same in the parent and child processes. The inheritance of process characteristics not defined by IEEE Std 1003.1-2001 is unspecified by IEEE Std 1003.1-2001.

    所有其他由 IEEE Std 1003.1-2001 定义的过程特性在父进程和子进程中应该是相同的。IEEE Std 1003.1-2001 未定义的过程特性的继承是不可靠的

    After fork(), both the parent and the child processes shall be capable of executing independently before either one terminates.

    在 fork()之后，父进程和子进程在任何一个终止之前都应该能够独立执行。

    [[https://coolshell.cn/articles/7965.html][一个和 fork 相关的面试题]]

