content/c/books/apue-notes.org
*** execve

    All process attributes are preserved during an execve(), except the following:

    执行 execve() 期间会保留所有进程属性，但以下内容除外：

    + The dispositions of any signals that are being caught are reset to the default (signal(7)).

      捕捉到的任何信号都重置为默认值。

    + Any alternate signal stack is not preserved (sigaltstack(2)).

      不保留任何备用的信号堆栈。

    + Memory mappings are not preserved (mmap(2)).

      不保留内存映射。

    + Attached System V shared memory segments are detached (shmat(2)).

      附加的 System V 内存会分离。

    + POSIX shared memory regions are unmapped (shm_open(3)).

      POSIX 共享内存区域会 unmapped。

    + Open POSIX message queue descriptors are closed (mq_overview(7)).

      打开的 POSIX 消息队列会关闭。

    + Any open POSIX named semaphores are closed (sem_overview(7)).

      任何打开的 POSIX 命名信号都是关闭的。

    + POSIX timers are not preserved (timer_create(2)).

      不保留 POSIX 计时器。

    + Any open directory streams are closed (opendir(3)).

      任何打开的目录流都会关闭。

    + Memory locks are not preserved (mlock(2), mlockall(2)).

      不保留内存锁。

    + Exit handlers are not preserved (atexit(3), on_exit(3)).

      不保留退出处理程序。

    + The floating-point environment is reset to the default (see fenv(3)).

      浮点环境重置为默认值。

    The process attributes in the preceding list are all specified in POSIX.1-2001. The following Linux-specific process attributes are also not preserved during an execve():

    前面列表中的进程属性都在 POSIX.1-2001 中指定。在 execve()期间，也不会保留以下特定于 Linux 的进程属性：

    + The prctl(2) PR_SET_DUMPABLE flag is set, unless a set-user-ID or set-group ID program is being executed, in which case it is cleared.

      除非正在执行 set-user-ID 或 set-group ID 程序，否则将设置 prctl（2）PR_SET_DUMPABLE 标志，在这种情况下它将被清除。

    + The prctl(2) PR_SET_KEEPCAPS flag is cleared.

      prctl（2）PR_SET_KEEPCAPS 标志被清除。

    + (Since Linux 2.4.36 / 2.6.23) If a set-user-ID or set-group-ID program is being executed, then the parent death signal set by prctl(2) PR_SET_PDEATHSIG flag is cleared.

      （自 Linux 2.4.36 / 2.6.23 起）如果正在执行 set-user-ID 或 set-group-ID 程序，则清除由 prctl（2）PR_SET_PDEATHSIG 标志设置的父死亡信号。

    + The process name, as set by prctl(2) PR_SET_NAME (and displayed by ps -o comm), is reset to the name of the new executable file.

      由 prctl（2）PR_SET_NAME（并由 ps -o comm 显示）设置的进程名称将重置为新可执行文件的名称。

    + The SECBIT_KEEP_CAPS securebits flag is cleared. See capabilities(7).

      SECBIT_KEEP_CAPS securebits 标志被清除。

    + The termination signal is reset to SIGCHLD (see clone(2)).

      终止信号被重置为 SIGCHLD（参见 clone（2））。

    Note the following further points:
    请注意以下几点：

    + All threads other than the calling thread are destroyed during an execve(). Mutexes, condition variables, and other pthreads objects are not preserved.

      在 execve（）期间，除调用线程之外的所有线程都将被销毁。互斥体，条件变量和其他 pthreads 对象不会被保留。

    + The equivalent of setlocale(LC_ALL, "C") is executed at program start-up.

      setlocale（LC_ALL，“C”）的等价物在程序启动时执行。

    + POSIX.1-2001 specifies that the dispositions of any signals that are ignored or set to the default are left unchanged. POSIX.1-2001 specifies one exception: if SIGCHLD is being ignored, then an implementation may leave the disposition unchanged or reset it to the default; Linux does the former.

      POSIX.1-2001 规定，任何被忽略或设置为默认值的信号的配置都保持不变。POSIX.1-2001 规定了一个例外：如果 SIGCHLD 被忽略，那么实现可能会保持处置不变或将其重置为默认值; Linux 做前者。

    + Any outstanding asynchronous I/O operations are canceled (aio_read(3), aio_write(3)).

      任何未完成的异步 I / O 操作都会被取消（aio_read（3），aio_write（3））。

    + For the handling of capabilities during execve(), see capabilities(7).

      有关在 execve（）期间处理功能的信息，请参阅功能（7）。

    + By default, file descriptors remain open across an execve(). File descriptors that are marked close-on-exec are closed; see the description of FD_CLOEXEC in fcntl(2). (If a file descriptor is closed, this will cause the release of all record locks obtained on the underlying file by this process. See fcntl(2) for details.) POSIX.1-2001 says that if file descriptors 0, 1, and 2 would otherwise be closed after a successful execve(), and the process would gain privilege because the set-user_ID or set-group_ID permission bit was set on the executed file, then the system may open an unspecified file for each of these file descriptors. As a general principle, no portable program, whether privileged or not, can assume that these three file descriptors will remain closed across an execve().

      默认情况下，文件描述符在 execve()中保持打开状态。标记为 close-on-exec 的文件描述符将被关闭; 请参阅 fcntl（2）中的 FD_CLOEXEC 说明。 （如果文件描述符被关闭，这将导致此进程释放在底层文件上获得的所有记录锁。有关详细信息，请参阅 fcntl（2）。）POSIX.1-2001 表示如果文件描述符为 0,1 和 2，在成功的 execve（）之后将关闭 ，并且因为在执行的文件上设置了 set-user_ID 或 set-group_ID 权限位，该进程将获得权限，然后系统可以为这些文件描述符中打开未指定的文件。作为一般原则，不管是否有权限的可移植程序都可以假设这三个文件描述符将在 execve（）中保持关闭状态。
* 第七章 进程环境
  1. main 函数的执行流程（程序员的自我修养）(todo)
  2. _exit 直接进入内核，exit 先执行标准 I/O 库的清理操作：对所有打开流调用 fclose 函数。
  3. 使用 atexit 来登记终止处理程序，每登记一次就会调用一次，如若程序调用 exec 函数族中的任意函数，则将清除所有已安装的终止处理程序。
  4. 如果 exec 没有出错，则 exec 之后的代码都不会执行。
  5. malloc、TCMalloc 原理以及应用。

* 第八章 进程控制
  1. 子进程获得父进程数据空间、堆、栈的副本。使用写时复制技术，这些由父子进程共享，内核将他们的访问权限改变为只读。如果父子进程试图修改这些区域，则内核只为修改区域的那块内存制作一个副本。
  2. 父子进程共享的属性。（L185）不继承：进程 ID，父进程 PID，tms_utime、tms_stime、tms_cutime、tms_ustime、文件锁、未处理的闹钟、未处理信号集。
  3. vfork 保证子进程先运行，在它调用 exec 或 exit 之后父进程才可能被调度运行。vfork 生成的子进程在调用 exec 或 exit 之前在父进程空间中运行，但如果子进程修改数据、进行函数调用、或者没有调用 exec 或 exit 就返回可能带来未知的结果。
  4. fork 两次来避免僵死进程和 waitpid 阻塞。

* 第九章 进程关系
* 第十章 信号
** 引言
** 信号概念
   L250:SIGKILL 和 SIGSTOP 是不能被忽略和捕捉的。

** 函数 signal
   注意：不要在 eshell 中通过 kill 给上面的程序发信号。

   signal 函数的限制：不改变信号的处理方式就不能确定信号的当前处理方式。当一个进程调用 fork 时，其子进程继承父进程的信号处理方式。
** 不可靠的信号
   不可靠是指信号可能会丢失。
** 中断的系统调用
   为什么系统调用会被中断？哪些系统调用会被中断？

   唤醒阻塞的低速系统调用。低速系统调用是可能会使进程永远阻塞的系统调用。

   为什么要设置自动重启功能？

   为了帮助应用程序使其不必处理被中断的系统调用。有时候用户并不知道所使用的输入、输出设备是否是低速设备。

   哪些系统调用中断以后会自动重启？
   ioctl、read、readv、write、writev、wait、waitpid。前五个只有对低速设备进行操作时才会被信号中断。

   如何控制系统调用重启？

   Posix 要求只有中断信号的 ~SA_RESTART~ 标识有效时，实现才重启系统调用。

** 可重入函数
   L262:信号处理程序会临时中断正在执行的正常指令序列，等从信号处理函数返回后，继续执行捕获时中断的正常指令序列。

   *但在信号处理程序中，不能判断捕捉信号时进程执行到何处。* 也就是说如果信号处理程序被中断就无法恢复执行了。所以需要一种能够在信号处理函数中安全运行，不被中断的函数。

   L262:表 10-4 说明了 *在信号处理程序中* 保证调用安全的函数，这些函数是可重入的，并被称为是异步信号安全的：除了可重入以外，在信号处理操作期间，它阻塞任何引起不一致的信号的发送。

   L263:函数不能重入的原因：
   + 已知它们使用静态数据结构。
   + 它们调用 malloc 或 free。
   + 它们是标准 I/O 函数。标准 I/O 函数的很多实现都以不可重入方式使用全局数据结构。

   L263: 每个线程中 errno 只有一个，因此，作为一个通用的规则：当在信号处理程序中调用图 10-4 的函数时，应当在调用前保存 errno，在调用后恢复 errno。

   在信号处理程序中调用一个非可重入函数，则其结果是不可预知的。

** SIGCLD 语义
** 可靠信号术语和语义
   L266: 内核在递送一个原来被阻塞的信号给进程时（而不是在产生该信号时），才决定对他的处理方式。

   如果在进程解除对某个信号的阻塞之前，这种信号发生了多次，那么如何呢？

   L267:Posix.1 并没有对投递给同一进程的信号进行排队。

   L267:每个进程都有一个信号屏蔽字，它规定了当前要阻塞传递给该信号的信号集。
