content/c/books/apue-notes.org
** 函数 kill 和 raise
   L268:如果调用 kill 为调用进程产生信号，而且此信号是不被阻塞的，那么在 kill 返回之前，signo 或者其他的未决的、非阻塞信号被传递至该进程。
** 函数 alerm 和 pause
   L268:每个进程只能有一个闹钟时间。注意 alarm 函数的参数和返回值的不同配置。

   L273:在信号处理函数中使用 longjump 要预防它可能和其他信号处理程序交互的问题。
** 信号集
** 函数 sigprocmask
   设置当前阻塞不能传递给进程的信号集。
** 函数 sigpending
   #+BEGIN_SRC c++ :tangle apue-notes/sigpending-test.cc
#include <iostream>
#include <signal.h>
#include <unistd.h>

void HandleQuit(int sig) {
	std::cout << "get quit signal" << std::endl;
	if(signal(SIGQUIT, SIG_DFL) == SIG_ERR) {
		std::cout << "reset quit signal to default error" << std::endl;
	}
}

int main(int argc, char *argv[])
{
	if(signal(SIGQUIT, HandleQuit) == SIG_ERR) {
		std::cout << "set quit signal error" << std::endl;
		return 1;
	}

	sigset_t newmask, oldmask;
	sigemptyset(&newmask);
	sigaddset(&newmask, SIGQUIT);
	if(sigprocmask(SIG_BLOCK, &newmask, &oldmask)) {
		std::cout << "set process signal mask error" << std::endl;
		return 1;
	}

	sleep(5);

	sigset_t pendingmask;
	if(sigpending(&pendingmask)) {
		std::cout << "get pending mask error" << std::endl;
		return 1;
	}
	if(sigismember(&pendingmask, SIGQUIT)){
		std::cout << "quit signal has been blocked" << std::endl;
	}

	sigprocmask(SIG_SETMASK, &oldmask, NULL);
	std::cout << "quit signal has unblocked" << std::endl;

	sleep(5);

    return 0;
}

   #+END_SRC
   获取进程当前阻塞的信号集。
** 函数 sigaction
   检查或修改预指定信号相关的处理动作。深入了解 sigaction 结构的 sa_mask 字段。
   #+BEGIN_SRC c++ :tangle apue-notes/sigaction-test.cc
#include <iostream>
#include <signal.h>
#include <unistd.h>

void HandleUsr(int sig) {
	std::cout << "get usr1 signal" << std::endl;
}

int main(int argc, char *argv[])
{
	std::cout << "pid: " << getpid() << std::endl;
	struct sigaction act;
	act.sa_handler = HandleUsr;
	sigemptyset(&act.sa_mask);
	act.sa_flags = 0;

	if(sigaction(SIGUSR1, &act, NULL)) {
		std::cout << "change signal handle error" << std::endl;
	}

	pause();

    return 0;
}

   #+END_SRC
** 函数 sigsetjump 和 siglongjmp
   当捕捉到一个信号时，进入信号捕捉函数，此时当前信号被自动地加入到进程的信号屏蔽字当中。这阻止了后来产生的这种信号中断该信号处理程序。
** 函数 sigsuspend
   如果希望对一个信号解阻塞，然后 pause 等待以前被阻塞的信号发生，该如何作合？使用 sigsuspend 函数可以在一个原子操作中先恢复信号屏蔽字，然后使进程休眠。

   进程的信号屏蔽字由参数 sigmask 指定。当程序返回时将进程的信号屏蔽字设置为调用 sigsuspend 之前的值。

** 函数 abort
** 函数 system
** 函数 sleep、nanosleep、和 ~clock_nanosleep~
** 函数 sigqueue
** 作业控制信号
** 信号名和编号
* 第十一章 线程
** 11.2 线程概念
   多个进程需要使用系统提供的复杂机制才能实现内存和文件描述符的共享，而多个线程自动的可以放问相同的存储地址和文件描述符。

   每个线程都包含有表示执行环境所必须的信息，其中包括进程中标识线程的线程 ID、一组寄存器值、栈、调度优先级和策略、信号屏蔽字、errno 变量以及线程私有数据。一个进程的所有信息对该进程的所有线程都是共享的，包括可执行程序的代码，程序的全局内存和堆内存、栈以及文件描述符。

** 11.3 线程标识
   + int pthread_equal(pthread_t t1, pthread_t t2);
   + pthread_t pthread_self(void);

** 11.4 线程创建
   + int pthread_create(pthread_t *thread, const pthread_attr_t *attr, void *(*start_routine) (void *), void *arg);
     + The  new  thread  inherits  a copy of the creating thread's signal mask (pthread_sigmask(3)).  The set of pending signals for the new thread is empty  (sigpending(2)).   The  new thread does not inherit the creating thread's alternate signal stack (sigaltstack(2)). The new thread inherits the calling thread's floating-point environment (fenv(3)).

       新线程继承创建线程的信号掩码（pthread_sigmask（3））的副本。新线程的挂起信号集为空（sigpending（2））。新线程不继承创建线程的备用信号堆栈（sigaltstack（2））。新线程继承了调用线程的浮点环境（fenv（3））。

     + Unless real-time  scheduling  policies  are  being employed, after a call to pthread_create(), it is indeterminate which thread—the caller or the new thread—will next execute.

       除非正在使用实时调度策略，否则在调用 pthread_create（）之后，接下来要执行的调用者或新线程的线程是不确定的。

     + A thread may either be joinable or detached.  If a thread is  joinable, then  another thread can call pthread_join(3) to wait for the thread to terminate and fetch its exit status.  Only when a  terminated  joinable thread  has  been joined are the last of its resources released back to the system.  When a detached thread terminates, its resources are automatically  released back to the system: it is not possible to join with the thread in order to  obtain its  exit  status.   Making  a  thread detached  is  useful for some types of daemon threads whose exit status the application does not need to care about.  By default, a new  thread is  created  in  a  joinable  state,  unless attr was set to create the thread in a detached state (using pthread_attr_setdetachstate(3)).

       线程可以是 joined 也可以是 detached。如果一个线程是 joined，那么另一个线程可以调用 pthread_join（3）来等待线程终止并获取其退出状态。仅当已终止的 joined 进程 被 join 时，其最后一个资源才会释放回系统。当 detached 线程终止时，其资源会自动释放回系统：无法与线程 join 以获取其退出状态。detached 线程对某些类型的守护程序线程非常有用，这些守护程序线程的退出状态是应用程序不需要关心的。默认情况下，创建新线程是 join 状态，除非将 attr 设置为以分离状态创建线程（使用 pthread_attr_setdetachstate（3））。

   参见 [[https://github.com/phenix3443/test/blob/master/c/thread/thread_create.c][thread_create.c]]

