c/books/apue-notes.html
<div id="outline-container-org21cac78" class="outline-3">
<h3 id="org21cac78">函数 kill 和 raise</h3>
<div class="outline-text-3" id="text-org21cac78">
<p>
L268:如果调用 kill 为调用进程产生信号，而且此信号是不被阻塞的，那么在 kill 返回之前，signo 或者其他的未决的、非阻塞信号被传递至该进程。
</p>
</div>
</div>
<div id="outline-container-orgc951cb0" class="outline-3">
<h3 id="orgc951cb0">函数 alerm 和 pause</h3>
<div class="outline-text-3" id="text-orgc951cb0">
<p>
L268:每个进程只能有一个闹钟时间。注意 alarm 函数的参数和返回值的不同配置。
</p>

<p>
L273:在信号处理函数中使用 longjump 要预防它可能和其他信号处理程序交互的问题。
</p>
</div>
</div>
<div id="outline-container-org12cf1e5" class="outline-3">
<h3 id="org12cf1e5">信号集</h3>
</div>
<div id="outline-container-org2bbe3cb" class="outline-3">
<h3 id="org2bbe3cb">函数 sigprocmask</h3>
<div class="outline-text-3" id="text-org2bbe3cb">
<p>
设置当前阻塞不能传递给进程的信号集。
</p>
</div>
</div>
<div id="outline-container-org7b4bb9e" class="outline-3">
<h3 id="org7b4bb9e">函数 sigpending</h3>
<div class="outline-text-3" id="text-org7b4bb9e">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;signal.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>

<span style="color: #00d7af;">void</span> <span style="color: #ffd700;">HandleQuit</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">sig</span>) {
    <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"get quit signal"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
    <span style="color: #a1db00;">if</span>(signal(SIGQUIT, SIG_DFL) == SIG_ERR) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"reset quit signal to default error"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
    }
}

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #a1db00;">if</span>(signal(SIGQUIT, HandleQuit) == SIG_ERR) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"set quit signal error"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        <span style="color: #a1db00;">return</span> 1;
    }

    <span style="color: #00d7af;">sigset_t</span> <span style="color: #ff8700;">newmask</span>, <span style="color: #ff8700;">oldmask</span>;
    sigemptyset(&amp;newmask);
    sigaddset(&amp;newmask, SIGQUIT);
    <span style="color: #a1db00;">if</span>(sigprocmask(SIG_BLOCK, &amp;newmask, &amp;oldmask)) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"set process signal mask error"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        <span style="color: #a1db00;">return</span> 1;
    }

    sleep(5);

    <span style="color: #00d7af;">sigset_t</span> <span style="color: #ff8700;">pendingmask</span>;
    <span style="color: #a1db00;">if</span>(sigpending(&amp;pendingmask)) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"get pending mask error"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        <span style="color: #a1db00;">return</span> 1;
    }
    <span style="color: #a1db00;">if</span>(sigismember(&amp;pendingmask, SIGQUIT)){
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"quit signal has been blocked"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
    }

    sigprocmask(SIG_SETMASK, &amp;oldmask, <span style="color: #5fafd7;">NULL</span>);
    <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"quit signal has unblocked"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;

    sleep(5);

    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>
<p>
获取进程当前阻塞的信号集。
</p>
</div>
</div>
<div id="outline-container-org7301f15" class="outline-3">
<h3 id="org7301f15">函数 sigaction</h3>
<div class="outline-text-3" id="text-org7301f15">
<p>
检查或修改预指定信号相关的处理动作。深入了解 sigaction 结构的 sa_mask 字段。
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;signal.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>

<span style="color: #00d7af;">void</span> <span style="color: #ffd700;">HandleUsr</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">sig</span>) {
    <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"get usr1 signal"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
}

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"pid: "</span> &lt;&lt; getpid() &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">sigaction</span> <span style="color: #ff8700;">act</span>;
    act.sa_handler = HandleUsr;
    sigemptyset(&amp;act.sa_mask);
    act.sa_flags = 0;

    <span style="color: #a1db00;">if</span>(<span style="color: #ff8700;">sigaction</span>(SIGUSR1, &amp;act, <span style="color: #5fafd7;">NULL</span>)) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"change signal handle error"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
    }

    pause();

    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>
</div>
</div>
<div id="outline-container-org657be25" class="outline-3">
<h3 id="org657be25">函数 sigsetjump 和 siglongjmp</h3>
<div class="outline-text-3" id="text-org657be25">
<p>
当捕捉到一个信号时，进入信号捕捉函数，此时当前信号被自动地加入到进程的信号屏蔽字当中。这阻止了后来产生的这种信号中断该信号处理程序。
</p>
</div>
</div>
<div id="outline-container-org1236761" class="outline-3">
<h3 id="org1236761">函数 sigsuspend</h3>
<div class="outline-text-3" id="text-org1236761">
<p>
如果希望对一个信号解阻塞，然后 pause 等待以前被阻塞的信号发生，该如何作合？使用 sigsuspend 函数可以在一个原子操作中先恢复信号屏蔽字，然后使进程休眠。
</p>

<p>
进程的信号屏蔽字由参数 sigmask 指定。当程序返回时将进程的信号屏蔽字设置为调用 sigsuspend 之前的值。
</p>
</div>
</div>

<div id="outline-container-org57ba4c3" class="outline-3">
<h3 id="org57ba4c3">函数 abort</h3>
</div>
<div id="outline-container-org7346267" class="outline-3">
<h3 id="org7346267">函数 system</h3>
</div>
<div id="outline-container-org7a35908" class="outline-3">
<h3 id="org7a35908">函数 sleep、nanosleep、和 <code>clock_nanosleep</code></h3>
</div>
<div id="outline-container-org8bf14cd" class="outline-3">
<h3 id="org8bf14cd">函数 sigqueue</h3>
</div>
<div id="outline-container-org98da2ce" class="outline-3">
<h3 id="org98da2ce">作业控制信号</h3>
</div>
<div id="outline-container-org2a94c9b" class="outline-3">
<h3 id="org2a94c9b">信号名和编号</h3>
</div>
</div>
<div id="outline-container-orgdbb783f" class="outline-2">
<h2 id="orgdbb783f">第十一章 线程</h2>
<div class="outline-text-2" id="text-orgdbb783f">
</div>
<div id="outline-container-org72c8f28" class="outline-3">
<h3 id="org72c8f28">11.2 线程概念</h3>
<div class="outline-text-3" id="text-org72c8f28">
<p>
多个进程需要使用系统提供的复杂机制才能实现内存和文件描述符的共享，而多个线程自动的可以放问相同的存储地址和文件描述符。
</p>

<p>
每个线程都包含有表示执行环境所必须的信息，其中包括进程中标识线程的线程 ID、一组寄存器值、栈、调度优先级和策略、信号屏蔽字、errno 变量以及线程私有数据。一个进程的所有信息对该进程的所有线程都是共享的，包括可执行程序的代码，程序的全局内存和堆内存、栈以及文件描述符。
</p>
</div>
</div>

<div id="outline-container-org88926bd" class="outline-3">
<h3 id="org88926bd">11.3 线程标识</h3>
<div class="outline-text-3" id="text-org88926bd">
<ul class="org-ul">
<li>int pthread_equal(pthread_t t1, pthread_t t2);</li>
<li>pthread_t pthread_self(void);</li>
</ul>
</div>
</div>

<div id="outline-container-org558b639" class="outline-3">
<h3 id="org558b639">11.4 线程创建</h3>
<div class="outline-text-3" id="text-org558b639">
<ul class="org-ul">
<li>int pthread_create(pthread_t *thread, const pthread_attr_t *attr, void *(*start_routine) (void *), void *arg);
<ul class="org-ul">
<li><p>
The  new  thread  inherits  a copy of the creating thread's signal mask (pthread_sigmask(3)).  The set of pending signals for the new thread is empty  (sigpending(2)).   The  new thread does not inherit the creating thread's alternate signal stack (sigaltstack(2)). The new thread inherits the calling thread's floating-point environment (fenv(3)).
</p>

<p>
新线程继承创建线程的信号掩码（pthread_sigmask（3））的副本。新线程的挂起信号集为空（sigpending（2））。新线程不继承创建线程的备用信号堆栈（sigaltstack（2））。新线程继承了调用线程的浮点环境（fenv（3））。
</p></li>

<li><p>
Unless real-time  scheduling  policies  are  being employed, after a call to pthread_create(), it is indeterminate which thread—the caller or the new thread—will next execute.
</p>

<p>
除非正在使用实时调度策略，否则在调用 pthread_create（）之后，接下来要执行的调用者或新线程的线程是不确定的。
</p></li>

<li><p>
A thread may either be joinable or detached.  If a thread is  joinable, then  another thread can call pthread_join(3) to wait for the thread to terminate and fetch its exit status.  Only when a  terminated  joinable thread  has  been joined are the last of its resources released back to the system.  When a detached thread terminates, its resources are automatically  released back to the system: it is not possible to join with the thread in order to  obtain its  exit  status.   Making  a  thread detached  is  useful for some types of daemon threads whose exit status the application does not need to care about.  By default, a new  thread is  created  in  a  joinable  state,  unless attr was set to create the thread in a detached state (using pthread_attr_setdetachstate(3)).
</p>

<p>
线程可以是 joined 也可以是 detached。如果一个线程是 joined，那么另一个线程可以调用 pthread_join（3）来等待线程终止并获取其退出状态。仅当已终止的 joined 进程 被 join 时，其最后一个资源才会释放回系统。当 detached 线程终止时，其资源会自动释放回系统：无法与线程 join 以获取其退出状态。detached 线程对某些类型的守护程序线程非常有用，这些守护程序线程的退出状态是应用程序不需要关心的。默认情况下，创建新线程是 join 状态，除非将 attr 设置为以分离状态创建线程（使用 pthread_attr_setdetachstate（3））。
</p></li>
</ul></li>
</ul>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/thread/thread_create.c">thread_create.c</a>
</p>
</div>
</div>
