c/books/apue-notes.html

<div id="outline-container-orga8d379d" class="outline-3">
<h3 id="orga8d379d">11.5 线程终止</h3>
<div class="outline-text-3" id="text-orga8d379d">
<ul class="org-ul">
<li>void pthread_exit(void *rval_ptr);
<ul class="org-ul">
<li><p>
If the thread has any thread-specific data, then, after the clean-up handlers have been executed, the  correasponding destructor functions are called, in an unspecified order.
</p>

<p>
如果线程具有任何特定于线程的数据，则在执行清理处理程序之后，将以未指定的顺序调用相应的析构函数。
</p></li>

<li><p>
After  the  last thread in a process terminates, the process terminates as by calling exit(3) with an exit status of zero; thus, process-shared resources  are  released  and  functions registered using atexit(3) are called.
</p>

<p>
在进程中的最后一个线程终止后，进程终止，如通过调用退出状态为零的 exit（3）; 因此，释放进程共享资源并调用使用 atexit（3）注册的函数。
</p></li>

<li><p>
To  allow  other  threads to continue execution, the main thread should terminate by calling pthread_exit() rather than exit(3).
</p>

<p>
要允许其他线程继续执行，主线程应该通过调用 pthread_exit（）而不是 exit（3）来终止。
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/thread/main_thread_exit.c">main_thread_exit.c</a>
</p></li>

<li><p>
The value pointed to by retval should not be  located  on  the  calling thread's  stack,  since  the contents of that stack are undefined after the thread terminates.
</p>

<p>
retval 指向的值不应该位于调用线程的堆栈上，因为在线程终止后该堆栈的内容是未定义的。
</p></li>
</ul></li>

<li><p>
int pthread_join(pthread_t thread, void *retval);
</p>

<p>
pthread_create 与 pthread_exit 传递的参数内存地址在调用者返回值后必须是有效的。
</p></li>

<li><p>
int pthread_cancel(pthread_t tid);
</p>

<p>
参见 <a href="https://github.com/phenix3443/test/blob/master/c/thread/main_thread_canceled.c">main_thread_canceled.c</a>
</p></li>

<li>void pthread_cleanup_push(void (<b>rtn)(void</b>), void *arg)</li>
<li><p>
void pthread_cleanup_pop(int execute)
</p>

<p>
线程也可以安排退出时需要调用的函数，类似进程的 atexit 函数。当线程执行以下动作时，清理函数 rtn 是由 <code>pthread_cleanup_push</code> 函数调度的，调用时只有一个参数 arg：
</p>
<ul class="org-ul">
<li>调用 <code>pthread_exit</code></li>
<li>响应取消请求时</li>
<li>用非零的 excute 参数调用 <code>pthread_cleanup_pop</code></li>
<li>或者是 return 返回。（ubuntu 验证）</li>
</ul>

<p>
<b>由于这两个函数实现为宏，所以必须在线程相同的作用域中以配对的形式使用。</b> 以下是这两个函数在 pthread.h 中的定义：
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">pthread_cleanup_push</span>(<span style="color: #ff8700;">routine</span>,<span style="color: #ff8700;">arg</span>) \

{

<span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">_pthread_cleanup_buffer</span> <span style="color: #ff8700;">_buffer</span>; \

_pthread_cleanup_push (&amp;_buffer, (routine), (arg));

<span style="color: #d18aff;">#define</span> <span style="color: #ffd700;">pthread_cleanup_pop</span>(<span style="color: #ff8700;">execute</span>) \

_pthread_cleanup_pop (&amp;_buffer, (execute)); \

    }
</pre>
</div></li>

<li>int pthread_detach(pthread_t tid);
<ul class="org-ul">
<li><p>
The detached attribute merely determines the  behavior  of  the  system when  the  thread terminates; it does not prevent the thread from being terminated if the process terminates using exit(3) (or equivalently, if the main thread returns).
</p>

<p>
detached 属性仅确定线程终止时系统的行为; 如果进程使用 exit（3）终止（或等效地，如果主线程返回），它不会阻止线程终止。
</p></li>

<li><p>
Either  pthread_join(3)  or  pthread_detach() should be called for each thread that an application creates, so that system  resources  for  the thread  can  be  released.  (But note that the resources of any threads for which one of these actions has not been done will be freed when the process terminates.)
</p>

<p>
应该为应用程序创建的每个线程调用 pthread_join（3）或 pthread_detach（），以便可以释放线程的系统资源。 （但请注意，当进程终止时，将释放尚未执行其中一个操作的任何线程的资源。）
</p></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9d76110" class="outline-3">
<h3 id="org9d76110">11.6 线程同步</h3>
<div class="outline-text-3" id="text-org9d76110">
<p>
当变量修改时间多于一个存储器访问周期的处理器结构中，当存储器读与写这两个周期交叉时，这种不一致就会出现。（什么是存储器周期？）
</p>

<p>
以下代码模拟线程的竞争情形：参见 <a href="https://github.com/phenix3443/test/blob/master/c/thread/thread_race.c">thread_race.c</a>
</p>
</div>

<div id="outline-container-org525a9a9" class="outline-4">
<h4 id="org525a9a9">11.6.1 互斥量（mutex）</h4>
<div class="outline-text-4" id="text-org525a9a9">
<p>
思考：一个线程对资源加锁了，另一个线程不加锁可以访问么？
</p>

<p>
当然可以，只有将所有线程都设计成遵守相同数据访问规则的，互斥机制才能正常工作。如果允许某个线程在没有得到锁的情况下也可以访问共享资源，那么即使其他的线程在使用共享资源前都申请锁，也还是会出现数据不一致的问题。所以 <b>要保证所有线程访问资源的规则是一致的</b> 。
</p>

<p>
使用动态分配的互斥量，在释放内存前需要调用 pthread_mutex_destory。
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_mutex_init</span>(<span style="color: #00d7af;">pthread_mutex_t</span> *<span style="color: #ff8700;">mutex</span>, <span style="color: #a1db00;">const</span> <span style="color: #00d7af;">pthread_mutexattr_t</span> *<span style="color: #ff8700;">attr</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_mutex_destory</span>(<span style="color: #00d7af;">pthread_mutex_t</span> *<span style="color: #ff8700;">mutex</span>);

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_mutex_lock</span>(<span style="color: #00d7af;">pthread_mutex_t</span> *<span style="color: #ff8700;">mutex</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_mutex_trylock</span>(<span style="color: #00d7af;">pthread_mutex_t</span> *<span style="color: #ff8700;">mutex</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_mutex_unlock</span>(<span style="color: #00d7af;">pthread_mutex_t</span> *<span style="color: #ff8700;">mutex</span>);

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_mutex_timelock</span>(<span style="color: #00d7af;">pthread_mutex_t</span> *<span style="color: #ff8700;">mutex</span>, <span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">timespec</span> *<span style="color: #ff8700;">tsptr</span>);  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">tsptr &#26159;&#32477;&#23545;&#26102;&#38388;</span>
</pre>
</div>

<p>
用互斥量解决前面的多线程竞争：参见 <a href="https://github.com/phenix3443/test/blob/master/c/thread/mutex.c">mutex.c</a>
</p>
</div>
</div>

<div id="outline-container-org5650de1" class="outline-4">
<h4 id="org5650de1">11.6.2 避免死锁</h4>
<div class="outline-text-4" id="text-org5650de1">
<p>
对已有互斥量再次加锁可能会导致死锁。
</p>

<p>
程序中使用多个互斥量，可以通过仔细控制互斥量加锁的顺序来避免死锁的发生。
</p>

<p>
可以用 pthread_mutex_trylock 接口避免死锁：如果该接口返回成功可以操作，否则，可以释放已经该占有的资源，做好清理工作，过一会再尝试。
</p>
</div>
</div>

<div id="outline-container-orgc233424" class="outline-4">
<h4 id="orgc233424">11.6.4 读写锁</h4>
<div class="outline-text-4" id="text-orgc233424">
<p>
有三种状态：加读锁，加写锁，不加锁。与互斥量相比，读写锁具有更高的并行性。非常适合于对数据结构读的次数大于写的情况。
</p>

<p>
虽然个操作系统对读写锁实现不同，但是当读写锁处于读模式锁住的状态，而这时有一个线程试图以写模式获取锁时，读写锁通常会阻塞随后读模式锁的请求。这样可以避免读模式锁长期占用，而等待的写模式锁请求一直得不到满足。
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_rwlock_init</span>(<span style="color: #00d7af;">pthread_rwlock_t</span> *<span style="color: #ff8700;">rwlock</span>, <span style="color: #00d7af;">pthread_rwlockattr_t</span> *<span style="color: #ff8700;">attr</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_rwlock_destroy</span>(<span style="color: #00d7af;">pthread_rwlock_t</span> *<span style="color: #ff8700;">rwlock</span>);

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_rwlock_rdlock</span>(<span style="color: #00d7af;">pthread_rwlock_t</span> *<span style="color: #ff8700;">rwlock</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_rwlock_wrlock</span>(<span style="color: #00d7af;">pthread_rwlock_t</span> *<span style="color: #ff8700;">rwlock</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_rwlock_unlock</span>(<span style="color: #00d7af;">pthread_rwlock_t</span> *<span style="color: #ff8700;">rwlock</span>);

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_rwlock_timedrdlock</span>(<span style="color: #00d7af;">pthread_rwlock_t</span> *<span style="color: #ff8700;">rwlock</span>, <span style="color: #a1db00;">const</span> <span style="color: #00d7af;">struce</span> <span style="color: #00d7af;">timespec</span> *<span style="color: #ff8700;">tsptr</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_rwlock_timedwrlock</span>(<span style="color: #00d7af;">pthread_rwlock_t</span> *<span style="color: #ff8700;">rwlock</span>, <span style="color: #a1db00;">const</span> <span style="color: #00d7af;">struce</span> <span style="color: #00d7af;">timespec</span> *<span style="color: #ff8700;">tsptr</span>);
</pre>
</div>
<p>
读写锁示例参见：<a href="https://github.com/phenix3443/test/blob/master/c/thread/rwlock.c">rwlock.c</a>
</p>
</div>
</div>
