content/c/books/apue-notes.org
*** 11.6.6 条件变量（condition）
	条件变量是线程可用的另一种 *同步机制* （不是互斥机制）。条件变量与互斥量一起使用时，允许线程 *以无竞争的方式等待特定的条件发生* 。

    *条件本身是由互斥量保护的* 。线程在 *改变条件状态* 之前必须首先锁住互斥量。其他线程在获得互斥量之前不会察觉这种改变，因为必须在锁定互斥量以后才能计算条件。

    #+BEGIN_SRC c
int pthread_cond_init(pthread_cond_t *cond, const pthread_condattr_t *attr);
int pthread_cond_destroy(pthread_cond_t *cond);

int phtread_cond_wait(pthread_cond_t cond, pthread_mutex_t *mutex);
int phtread_cond_timedwait(pthread_cond_t cond, pthread_mutex_t *mutex, const struct timespec *tsptr);
    #+END_SRC

	传递给 ~pthread_cond_wait~ 的互斥量对条件进行保护。调用者把锁住的互斥量传给函数，函数然后自动把调用线程放到等待的线程列表上，对互斥量解锁。（这样就使得判断和休眠成了原子操作） *这就关闭了条件检查和线程进入休眠状态等待条件改变之间的时间通道，这样线程就不会错过条件的任何变化。*

    示例代码参见 [[https://github.com/phenix3443/test/blob/master/c/thread/cond.c][cond.c]]

	上面线程代码使用了 pthread_cond_wait(&cond,&mutex); 在条件变量上休眠等待主线程发送信号过来。 那么就存在一个问题：假想一下，当主线程发送信号过来后。在子线程 在 ~pthread_cond_wait~ 上等待发现信号发过来了，那么子线程将醒来并运行（注意这个时候 pthread_cond_wait 还未返回，那么锁是释放的，因为 ~pthread_cond_wait~ 在等待时会释放锁，返回时才会重新获得锁），那么如果这时候另一个线程改变了 i，但是切换到子线程时他并不知情，它会仍旧认为条件是满足的。也就是说我们不应该仅仅依靠 ~pthread_cond_wait~ 的返回就认为条件满足。 * ~pthread_cond_wait~ 返回时，线程需要重新计算条件，所以互斥量再次被锁住。*

    等待信号端代码：
    #+BEGIN_SRC c
pthread_mutex_lock(&mutex); //必须先锁住条件，然后才能判断
while(condition is not match) { // 进行条件不满足判断，注意不要使用 if，从 wait 返回之后还需要进行条件判断
    pthread_cond_wait(&cond, &mutex);
 }
/* 在这里做一些修改条件的操作 */

pthread_mutex_unlock(&mutex);
    #+END_SRC

    产生信号端代码：
    #+BEGIN_SRC c
pthread_mutex_lock(&p_lock);
/* 这里是修改条件的代码，是条件成立 */
pthread_mutex_unlock(&p_lock);

pthread_cond_signal(&cond);
    #+END_SRC
*** 11.6.7 自旋锁（spin lock）
	自旋锁与互斥量类似，但它不是通过休眠使线程阻塞，而是在获取锁之前一致处于忙等待阻塞状态。自旋锁主要用于以下情况：锁被持有的时间短，而且线程并不希望在重新调度上花费太多的成本。

    自旋锁通过作为底层原语实现其他的类型的锁。

    当自旋锁用在非抢占式内核中时是非常有用的：除了提供互斥机制以外，它们会阻塞中断，这样中断处理程序就不会让系统陷入死锁状态，因为它需要获取已被加锁的自旋锁。

	但在用户层，自旋锁并不是非常有用，除非运行在不允许抢占的实时调度类中。运行在分时调度类中的用户层线程在两种情况下可以被取消调度：当它们的时间片到期时，或者具有更高调度优先级的线程就绪变成可运行时。在这些情况下，如果线程拥有自旋锁，它就会进入休眠状态，阻塞在锁上的其他线程自旋时间可能比预期的时间更长。

    很多互斥量的实现非常高效，以至于应用程序采用互斥锁的性能与曾经采用过的自旋锁的性能基本是相同的。事实上，有些互斥量的实现在试图获取互斥量的时候会自旋一小段时间，只有在自旋计数到达某一阈值的时候才会休眠。这些因素，加上现代处理的进步，使得上下文切换变得原来越快，也似地自旋锁只有在特定的情况下有用。

    #+BEGIN_SRC c
int pthread_spin_init(pthread_spinlock_t *lock, int pshared);
int pthread_spin_destroy(pthread_spinlock_t *lock);

int pthread_spin_lock(pthread_spinlock_t *lock);
int pthread_spin_trylock(pthread_spinlock_t *lock);
int pthread_spin_unlock(pthread_spinlock_t *lock);
    #+END_SRC

    注意：
    1. 对已经加锁的自旋锁加锁结果是未定义的，调用 pthread_spin_lock 会返回 EDEADLK 错误（或其他错误），或者调用可能会永久自旋。具体行为依赖于实际的实现。
    2. 试图对没有加锁的自旋锁解锁结果也是未定义的。
    3. 不要调用在持有自旋锁的情况下可能会进入休眠状态的函数。如果调用了这些函数，会浪费 CPU 资源，因为其他线程需要自旋锁需要等待的时间就延长了。

*** 11.6.8 屏障（barrier）
	屏障是用户协调多个进程并行工作的同步机制。屏障允许每个线程等待，直到所有的合作线程都到达某一点，然后从该点继续执行。

	简单来说：
	+ cond 情景：条件达到了，大家一起干，干完大家就没事了（pthread_exit）。
	+ barrier 情景：先大家干到统一进度，然后在各自干各自的。

    #+BEGIN_SRC c
int pthread_barrier_init(pthread_barrier_t *barrier , const pthread_barrierattr_t *attr, unsigned int count);
int pthread_barrier_destory(pthread_barrier_t *barrier);
int pthread_barrier_wait(pthread_barrier_t *barrier);
    #+END_SRC

    示例代码参见[[https://github.com/phenix3443/test/blob/master/c/thread/barrier.c][barrier.c]]

* 第十二章 线程控制
