c/books/apue-notes.html

<div id="outline-container-org701799a" class="outline-4">
<h4 id="org701799a">11.6.6 条件变量（condition）</h4>
<div class="outline-text-4" id="text-org701799a">
<p>
条件变量是线程可用的另一种 <b>同步机制</b> （不是互斥机制）。条件变量与互斥量一起使用时，允许线程 <b>以无竞争的方式等待特定的条件发生</b> 。
</p>

<p>
<b>条件本身是由互斥量保护的</b> 。线程在 <b>改变条件状态</b> 之前必须首先锁住互斥量。其他线程在获得互斥量之前不会察觉这种改变，因为必须在锁定互斥量以后才能计算条件。
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_cond_init</span>(<span style="color: #00d7af;">pthread_cond_t</span> *<span style="color: #ff8700;">cond</span>, <span style="color: #a1db00;">const</span> <span style="color: #00d7af;">pthread_condattr_t</span> *<span style="color: #ff8700;">attr</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_cond_destroy</span>(<span style="color: #00d7af;">pthread_cond_t</span> *<span style="color: #ff8700;">cond</span>);

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">phtread_cond_wait</span>(<span style="color: #00d7af;">pthread_cond_t</span> <span style="color: #ff8700;">cond</span>, <span style="color: #00d7af;">pthread_mutex_t</span> *<span style="color: #ff8700;">mutex</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">phtread_cond_timedwait</span>(<span style="color: #00d7af;">pthread_cond_t</span> <span style="color: #ff8700;">cond</span>, <span style="color: #00d7af;">pthread_mutex_t</span> *<span style="color: #ff8700;">mutex</span>, <span style="color: #a1db00;">const</span> <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">timespec</span> *<span style="color: #ff8700;">tsptr</span>);
</pre>
</div>

<p>
传递给 <code>pthread_cond_wait</code> 的互斥量对条件进行保护。调用者把锁住的互斥量传给函数，函数然后自动把调用线程放到等待的线程列表上，对互斥量解锁。（这样就使得判断和休眠成了原子操作） <b>这就关闭了条件检查和线程进入休眠状态等待条件改变之间的时间通道，这样线程就不会错过条件的任何变化。</b>
</p>

<p>
示例代码参见 <a href="https://github.com/phenix3443/test/blob/master/c/thread/cond.c">cond.c</a>
</p>

<p>
上面线程代码使用了 pthread_cond_wait(&amp;cond,&amp;mutex); 在条件变量上休眠等待主线程发送信号过来。 那么就存在一个问题：假想一下，当主线程发送信号过来后。在子线程 在 <code>pthread_cond_wait</code> 上等待发现信号发过来了，那么子线程将醒来并运行（注意这个时候 pthread_cond_wait 还未返回，那么锁是释放的，因为 <code>pthread_cond_wait</code> 在等待时会释放锁，返回时才会重新获得锁），那么如果这时候另一个线程改变了 i，但是切换到子线程时他并不知情，它会仍旧认为条件是满足的。也就是说我们不应该仅仅依靠 <code>pthread_cond_wait</code> 的返回就认为条件满足。 * <code>pthread_cond_wait</code> 返回时，线程需要重新计算条件，所以互斥量再次被锁住。*
</p>

<p>
等待信号端代码：
</p>
<div class="org-src-container">
<pre class="src src-c">pthread_mutex_lock(&amp;mutex); <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#24517;&#39035;&#20808;&#38145;&#20303;&#26465;&#20214;&#65292;&#28982;&#21518;&#25165;&#33021;&#21028;&#26029;</span>
<span style="color: #a1db00;">while</span>(condition is <span style="color: #00d7af;">not</span> <span style="color: #ff8700;">match</span>) { <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#36827;&#34892;&#26465;&#20214;&#19981;&#28385;&#36275;&#21028;&#26029;&#65292;&#27880;&#24847;&#19981;&#35201;&#20351;&#29992; if&#65292;&#20174; wait &#36820;&#22238;&#20043;&#21518;&#36824;&#38656;&#35201;&#36827;&#34892;&#26465;&#20214;&#21028;&#26029;</span>
    pthread_cond_wait(&amp;cond, &amp;mutex);
 }
<span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#22312;&#36825;&#37324;&#20570;&#19968;&#20123;&#20462;&#25913;&#26465;&#20214;&#30340;&#25805;&#20316; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>

pthread_mutex_unlock(&amp;mutex);
</pre>
</div>

<p>
产生信号端代码：
</p>
<div class="org-src-container">
<pre class="src src-c">pthread_mutex_lock(&amp;p_lock);
<span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">&#36825;&#37324;&#26159;&#20462;&#25913;&#26465;&#20214;&#30340;&#20195;&#30721;&#65292;&#26159;&#26465;&#20214;&#25104;&#31435; </span><span style="color: #6c6c6c; font-style: italic;">*/</span>
pthread_mutex_unlock(&amp;p_lock);

pthread_cond_signal(&amp;cond);
</pre>
</div>
</div>
</div>
<div id="outline-container-org289e57f" class="outline-4">
<h4 id="org289e57f">11.6.7 自旋锁（spin lock）</h4>
<div class="outline-text-4" id="text-org289e57f">
<p>
自旋锁与互斥量类似，但它不是通过休眠使线程阻塞，而是在获取锁之前一致处于忙等待阻塞状态。自旋锁主要用于以下情况：锁被持有的时间短，而且线程并不希望在重新调度上花费太多的成本。
</p>

<p>
自旋锁通过作为底层原语实现其他的类型的锁。
</p>

<p>
当自旋锁用在非抢占式内核中时是非常有用的：除了提供互斥机制以外，它们会阻塞中断，这样中断处理程序就不会让系统陷入死锁状态，因为它需要获取已被加锁的自旋锁。
</p>

<p>
但在用户层，自旋锁并不是非常有用，除非运行在不允许抢占的实时调度类中。运行在分时调度类中的用户层线程在两种情况下可以被取消调度：当它们的时间片到期时，或者具有更高调度优先级的线程就绪变成可运行时。在这些情况下，如果线程拥有自旋锁，它就会进入休眠状态，阻塞在锁上的其他线程自旋时间可能比预期的时间更长。
</p>

<p>
很多互斥量的实现非常高效，以至于应用程序采用互斥锁的性能与曾经采用过的自旋锁的性能基本是相同的。事实上，有些互斥量的实现在试图获取互斥量的时候会自旋一小段时间，只有在自旋计数到达某一阈值的时候才会休眠。这些因素，加上现代处理的进步，使得上下文切换变得原来越快，也似地自旋锁只有在特定的情况下有用。
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_spin_init</span>(<span style="color: #00d7af;">pthread_spinlock_t</span> *<span style="color: #ff8700;">lock</span>, <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">pshared</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_spin_destroy</span>(<span style="color: #00d7af;">pthread_spinlock_t</span> *<span style="color: #ff8700;">lock</span>);

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_spin_lock</span>(<span style="color: #00d7af;">pthread_spinlock_t</span> *<span style="color: #ff8700;">lock</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_spin_trylock</span>(<span style="color: #00d7af;">pthread_spinlock_t</span> *<span style="color: #ff8700;">lock</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_spin_unlock</span>(<span style="color: #00d7af;">pthread_spinlock_t</span> *<span style="color: #ff8700;">lock</span>);
</pre>
</div>

<p>
注意：
</p>
<ol class="org-ol">
<li>对已经加锁的自旋锁加锁结果是未定义的，调用 pthread_spin_lock 会返回 EDEADLK 错误（或其他错误），或者调用可能会永久自旋。具体行为依赖于实际的实现。</li>
<li>试图对没有加锁的自旋锁解锁结果也是未定义的。</li>
<li>不要调用在持有自旋锁的情况下可能会进入休眠状态的函数。如果调用了这些函数，会浪费 CPU 资源，因为其他线程需要自旋锁需要等待的时间就延长了。</li>
</ol>
</div>
</div>

<div id="outline-container-orgfc31d6b" class="outline-4">
<h4 id="orgfc31d6b">11.6.8 屏障（barrier）</h4>
<div class="outline-text-4" id="text-orgfc31d6b">
<p>
屏障是用户协调多个进程并行工作的同步机制。屏障允许每个线程等待，直到所有的合作线程都到达某一点，然后从该点继续执行。
</p>

<p>
简单来说：
</p>
<ul class="org-ul">
<li>cond 情景：条件达到了，大家一起干，干完大家就没事了（pthread_exit）。</li>
<li>barrier 情景：先大家干到统一进度，然后在各自干各自的。</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_barrier_init</span>(<span style="color: #00d7af;">pthread_barrier_t</span> *<span style="color: #ff8700;">barrier</span> , <span style="color: #a1db00;">const</span> <span style="color: #00d7af;">pthread_barrierattr_t</span> *<span style="color: #ff8700;">attr</span>, <span style="color: #00d7af;">unsigned</span> <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">count</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_barrier_destory</span>(<span style="color: #00d7af;">pthread_barrier_t</span> *<span style="color: #ff8700;">barrier</span>);
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">pthread_barrier_wait</span>(<span style="color: #00d7af;">pthread_barrier_t</span> *<span style="color: #ff8700;">barrier</span>);
</pre>
</div>

<p>
示例代码参见<a href="https://github.com/phenix3443/test/blob/master/c/thread/barrier.c">barrier.c</a>
</p>
</div>
</div>
</div>
</div>
