c/books/apue-notes.html

<div id="outline-container-org6f67e7f" class="outline-2">
<h2 id="org6f67e7f">第十二章 线程控制</h2>
<div class="outline-text-2" id="text-org6f67e7f">
</div>
<div id="outline-container-org62ea33e" class="outline-3">
<h3 id="org62ea33e">12.2 线程属性</h3>
<div class="outline-text-3" id="text-org62ea33e">
<p>
属性值不能直接设置，须使用相关函数进行操作，初始化的函数为 <code>pthread_attr_init</code> ，这个函数必须在 <code>pthread_create</code> 函数之前调用。之后须用 <code>pthread_attr_destroy</code> 函数来释放资源。线程属性主要包括如下属性：作用域（scope）、栈尺寸（stack size）、栈地址（stack address）、优先级（priority）、分离的状态（detached state）、调度策略和参数（scheduling policy and parameters）。默认的属性为非绑定、非分离、缺省 1M 的堆栈、与父进程同样级别的优先级。
</p>

<p>
线程属性标识符：pthread_attr_t 包含在 pthread.h 头文件中。
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#23646;&#24615;&#32467;&#26500;&#22914;&#19979;&#65306;</span>
<span style="color: #a1db00;">typedef</span> <span style="color: #a1db00;">struct</span>
{
    <span style="color: #00d7af;">int</span>                   <span style="color: #ff8700;">detachstate</span>;      <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#30340;&#20998;&#31163;&#29366;&#24577;</span>
    <span style="color: #00d7af;">int</span>                   <span style="color: #ff8700;">schedpolicy</span>;     <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#35843;&#24230;&#31574;&#30053;</span>
    <span style="color: #a1db00;">struct</span> <span style="color: #00d7af;">sched_param</span>     <span style="color: #ff8700;">schedparam</span>;      <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#30340;&#35843;&#24230;&#21442;&#25968;</span>
    <span style="color: #00d7af;">int</span>                   <span style="color: #ff8700;">inheritsched</span>;    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#30340;&#32487;&#25215;&#24615;</span>
    <span style="color: #00d7af;">int</span>                   <span style="color: #ff8700;">scope</span>;           <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#30340;&#20316;&#29992;&#22495;</span>
    <span style="color: #00d7af;">size_t</span>                <span style="color: #ff8700;">guardsize</span>;       <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#26632;&#26411;&#23614;&#30340;&#35686;&#25106;&#32531;&#20914;&#21306;&#22823;&#23567;</span>
    <span style="color: #00d7af;">int</span>                   <span style="color: #ff8700;">stackaddr_set</span>;   <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#30340;&#26632;&#35774;&#32622;</span>
    <span style="color: #00d7af;">void</span>*                 <span style="color: #ff8700;">stackaddr</span>;       <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#26632;&#30340;&#20301;&#32622;</span>
    <span style="color: #00d7af;">size_t</span>                <span style="color: #ff8700;">stacksize</span>;       <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#32447;&#31243;&#26632;&#30340;&#22823;&#23567;</span>
}<span style="color: #00d7af;">pthread_attr_t</span>;
</pre>
</div>

<ul class="org-ul">
<li><p>
线程的作用域（scope）
</p>

<p>
作用域属性描述特定线程将与哪些线程竞争资源。线程可以在两种竞争域内竞争资源：
</p>
<ul class="org-ul">
<li>进程域（process scope）：与同一进程内的其他线程。</li>
<li>系统域（system scope）：与系统中的所有线程。一个具有系统域的线程将与整个系统中所有具有系统域的线程按照优先级竞争处理器资源，进行调度。</li>
<li>Solaris 系统，实际上，从 Solaris 9 发行版开始，系统就不再区分这两个范围。</li>
</ul></li>
<li><p>
线程的绑定状态（binding state）
</p>

<p>
关于线程的绑定，牵涉到另外一个概念：轻进程（LWP：Light Weight Process）：轻进程可以理解为内核线程，它位于用户层和系统层之间。系统对线程资源的分配、对线程的控制是通过轻进程来实现的，一个轻进程可以控制一个或多个线程。
</p>
<ul class="org-ul">
<li><p>
非绑定状态
</p>

<p>
默认状况下，启动多少轻进程、哪些轻进程来控制哪些线程是由系统来控制的，这种状况即称为非绑定的。
</p></li>

<li><p>
绑定状态
</p>

<p>
绑定状况下，则顾名思义，即某个线程固定的 "绑" 在一个轻进程之上。被绑定的线程具有较高的响应速度，这是因为 CPU 时间片的调度是面向轻进程的，绑定的线程可以保证在需要的时候它总有一个轻进程可用。通过设置被绑定的轻进程的优先级和调度级可以使得绑定的线程满足诸如实时反应之类的要求。
</p></li>
</ul></li>

<li><p>
线程的分离状态（detached state）
</p>

<p>
线程的分离状态决定一个线程以什么样的方式来终止自己。
</p>
<ul class="org-ul">
<li><p>
非分离状态
</p>

<p>
线程的默认属性是非分离状态，这种情况下，原有的线程等待创建的线程结束。只有当 pthread_join() 函数返回时，创建的线程才算终止，才能释放自己占用的系统资源。
</p></li>

<li><p>
分离状态
</p>

<p>
分离线程没有被其他的线程所等待，自己运行结束了，线程也就终止了，马上释放系统资源。应该根据自己的需要，选择适当的分离状态。
</p></li>

<li><p>
线程分离状态的函数： <code>pthread_attr_setdetachstate（pthread_attr_t *attr, int detachstate）</code> 。第二个参数可选为 <code>PTHREAD_CREATE_DETACHED</code> （分离线程）和  <code>PTHREAD_CREATE_JOINABLE</code> （非分离线程）。
</p>

<p>
这里要注意的一点是，如果设置一个线程为分离线程，而这个线程运行又非常快，它很可能在 <code>pthread_create</code> 函数返回之前就终止了，它终止以后就可能将线程号和系统资源移交给其他的线程使用，这样调用 <code>pthread_create</code> 的线程就得到了错误的线程号。要避免这种情况可以采取一定的同步措施，最简单的方法之一是可以在被创建的线程里调用 <code>pthread_cond_timewait</code> 函数，让这个线程等待一会儿，留出足够的时间让函数 <code>pthread_create</code> 返回。设置一段等待时间，是在多线程编程里常用的方法。但是注意不要使用诸如 <code>wait()</code> 之类的函数，它们是使整个进程睡眠，并不能解决线程同步的问题。
</p></li>
</ul></li>

<li>线程的优先级（priority）
<ul class="org-ul">
<li>新线程的优先级为默认为 0。</li>
<li>新线程不继承父线程调度优先级  <code>(PTHREAD_EXPLICIT_SCHED)</code> 。</li>
<li>仅当调度策略为实时（即 <code>SCHED_RR</code> 或 <code>SCHED_FIFO</code> ）时才有效，并可以在运行时通过 <code>pthread_setschedparam()</code> 函数来改变，缺省为 0。</li>
</ul></li>

<li>线程的栈地址（stack address）
<ul class="org-ul">
<li>POSIX.1 定义了两个常量 <code>_POSIX_THREAD_ATTR_STACKADDR 和_POSIX_THREAD_ATTR_STACKSIZE</code> 检测系统是否支持栈属性。</li>
<li>也可以给 sysconf 函数传递 <code>_SC_THREAD_ATTR_STACKADDR 或 _SC_THREAD_ATTR_STACKSIZE</code> 来进行检测。</li>
<li>当进程栈地址空间不够用时，指定新建线程使用由 malloc 分配的空间作为自己的栈空间。通过  <code>pthread_attr_setstackaddr 和 pthread_attr_getstackaddr</code> 两个函数分别设置和获取线程的栈地址。传给 <code>pthread_attr_setstackaddr</code> 函数的地址是缓冲区的低地址（不一定是栈的开始地址，栈可能从高地址往低地址增长）。</li>
</ul></li>

<li>线程的栈大小（stack size）
<ul class="org-ul">
<li>当系统中有很多线程时，可能需要减小每个线程栈的默认大小，防止进程的地址空间不够用。</li>
<li>当线程调用的函数会分配很大的局部变量或者函数调用层次很深时，可能需要增大线程栈的默认大小。</li>
<li>函数 <code>pthread_attr_getstacksize 和 pthread_attr_setstacksize</code> 提供设置。</li>
</ul></li>

<li>线程的栈保护区大小（stack guard size）
<ul class="org-ul">
<li>在线程栈顶留出一段空间，防止栈溢出。</li>
<li>当栈指针进入这段保护区时，系统会发出错误，通常是发送信号给线程。</li>
<li>该属性默认值是 PAGESIZE 大小，该属性被设置时，系统会自动将该属性大小补齐为页大小的整数倍。</li>
<li>当改变栈地址属性时，栈保护区大小通常清零。</li>
</ul></li>

<li>线程的调度策略（schedpolicy）
POSIX 标准指定了三种调度策略：先入先出策略 (<code>SCHED_FIFO</code>)、循环策略 (<code>SCHED_RR</code>) 和自定义策略 (<code>SCHED_OTHER</code>)。 <code>SCHED_FIFO</code>  是基于队列的调度程序，对于每个优先级都会使用不同的队列。 <code>SCHED_RR</code> 与 FIFO 相似，不同的是前者的每个线程都有一个执行时间配额。 <code>SCHED_FIFO 和 SCHED_RR</code> 是对 POSIX Realtime 的扩展。 <code>SCHED_OTHER</code> 是缺省的调度策略。
<ul class="org-ul">
<li>新线程默认使用 <code>SCHED_OTHER</code> 调度策略。线程一旦开始运行，直到被抢占或者直到线程阻塞或停止为止。</li>

<li><p>
<code>SCHED_FIFO</code>
</p>

<p>
如果调用进程具有有效的用户 ID 0，则争用范围为系统 <code>(PTHREAD_SCOPE_SYSTEM)</code> 的先入先出线程属于实时 (RT) 调度类。如果这些线程未被优先级更高的线程抢占，则会继续处理该线程，直到该线程放弃或阻塞为止。对于具有进程争用范围 (PTHREAD_SCOPE_PROCESS)) 的线程或其调用进程没有有效用户 ID 0 的线程，请使用 <code>SCHED_FIFO，SCHED_FIFO</code> 基于 TS 调度类。
</p></li>

<li><p>
<code>SCHED_RR</code>
</p>

<p>
如果调用进程具有有效的用户 ID 0，则争用范围为系统 (<code>PTHREAD_SCOPE_SYSTEM</code>) 的循环线程属于实时 (RT) 调度类。如果这些线程未被优先级更高的线程抢占，并且这些线程没有放弃或阻塞，则在系统确定的时间段内将一直执行这些线程。对于具有进程争用范围 (<code>PTHREAD_SCOPE_PROCESS</code>) 的线程，请使用 <code>SCHED_RR</code> (基于 TS 调度类)。此外，这些线程的调用进程没有有效的用户 ID 0。
</p></li>
</ul></li>

<li><p>
线程并行级别（concurrency）
</p>

<p>
应用程序使用 <code>pthread_setconcurrency()</code> 通知系统其所需的并发级别。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orga6d8f7c" class="outline-3">
<h3 id="orga6d8f7c">12.4 同步属性</h3>
<div class="outline-text-3" id="text-orga6d8f7c">
</div>
<div id="outline-container-org0a68e8c" class="outline-4">
<h4 id="org0a68e8c">12.4.1 互斥量属性</h4>
<div class="outline-text-4" id="text-org0a68e8c">
</div>
<div id="outline-container-orge7eb1c2" class="outline-5">
<h5 id="orge7eb1c2">共享属性</h5>
<div class="outline-text-5" id="text-orge7eb1c2">
<p>
从多个进程彼此间共享的内存数据块中分配的互斥量就可以用于这些进程的同步。
</p>
</div>
</div>
<div id="outline-container-orgfa9c027" class="outline-5">
<h5 id="orgfa9c027">健壮属性</h5>
<div class="outline-text-5" id="text-orgfa9c027">
<p>
与在多个进程间共享的互斥量有关，当持有互斥量的进程终止时，解决互斥量状态恢复的问题。
</p>

<p>
在创建 pthread mutex 的时候，指定为 ROBUST 模式。
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00d7af;">pthread_mutexattr_t</span> <span style="color: #ff8700;">ma</span>;

pthread_mutexattr_init(&amp;ma);
pthread_mutexattr_setpshared(&amp;ma, PTHREAD_PROCESS_SHARED);
pthread_mutexattr_setrobust(&amp;ma, PTHREAD_MUTEX_ROBUST);

pthread_mutex_init(&amp;c-&gt;lock, &amp;ma);
</pre>
</div>

<p>
需要注意的地方是：如果持有 mutex 的线程退出，另外一个线程在 <code>pthread_mutex_lock</code> 的时候会返回 EOWNERDEAD。这时候你需要调用 <code>pthread_mutex_consistent</code> 函数来清除这种状态，否则后果自负。
</p>

<p>
写成代码就是这样子：
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #00d7af;">int</span> <span style="color: #ff8700;">r</span> = pthread_mutex_lock(lock);
<span style="color: #a1db00;">if</span> (r == EOWNERDEAD)
    pthread_mutex_consistent(lock);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9bf31a" class="outline-5">
<h5 id="orgf9bf31a">类型属性<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h5>
<div class="outline-text-5" id="text-orgf9bf31a">
<p>
控制互斥量的锁定特性，如错误检查，死锁检测，递归加锁等。
</p>

<p>
L348: <code>pthread_cond_wait</code> 不要使用可递归的互斥互斥量。递归互斥量可能会导致死锁。
</p>
</div>
</div>
</div>
<div id="outline-container-org01a6ddc" class="outline-4">
<h4 id="org01a6ddc">12.4.2 读写锁属性</h4>
<div class="outline-text-4" id="text-org01a6ddc">
<p>
只支持进程共享属性。
</p>
</div>
</div>
<div id="outline-container-org0ff620c" class="outline-4">
<h4 id="org0ff620c">12.4.3 条件变量属性</h4>
<div class="outline-text-4" id="text-org0ff620c">
<p>
支持进程共享属性和时钟属性。
</p>
</div>
</div>
<div id="outline-container-orga65555b" class="outline-4">
<h4 id="orga65555b">12.4.4 屏障属性</h4>
<div class="outline-text-4" id="text-orga65555b">
<p>
只支持进程共享属性。
</p>
</div>
</div>
</div>
<div id="outline-container-org68c87b0" class="outline-3">
<h3 id="org68c87b0">12.5 重入</h3>
<div class="outline-text-3" id="text-org68c87b0">
<p>
如果一个函数在相同的时间点可以被多个线程安全的调用，就称该函数是线程安全的。
</p>

<p>
如果函数对异步信号处理程序的重入是安全的，那么就可以说函数是异步信号安全的。
</p>

<p>
flockfile 以线程安全的方式来管理 FILE 对象。
</p>

<p>
使用递归互斥量在异步信号中断的情况下阻止其他线程改变保护的数据结构。
</p>
</div>
</div>
