content/c/books/apue-notes.org
** 12.6 线程特定数据
   为什么需要组织线程数据共享的接口呢？两个原因：
   + 有时候需要维护基于每线程的数据，而不需要担心与其他线程的同步访问问题。
   + 提供了让基于进程的接口适应多线程环境的机制。

	 除了使用寄存器以外，一个线程没有办法阻止另一个线程访问它的数据。线程特定数据也不例外。虽然底层的实现部分并不能阻止这种访问能力，但管理线程特定数据的函数可以提高线程间的数据独立性，使得线程不太容易访问到其他线程的线程特定数据。

   #+BEGIN_SRC c++ :tangle apue-notes/strtok-test.cc
#include <iostream>
#include <cstdio>
#include <cstring>

int main(int argc, char *argv[])
{
    char str[] = "hello,this is a test string";
	char *p = strtok(str,", ");
	while(p) {
		std::cout << p << std::endl;
		p = strtok(NULL, " ");
	}
    return 0;
}
   #+END_SRC

   这里的 strtok 使用全局变量来保存要待分析的字符串，这是不是线程安全的。如果多线程同时使用这个函数会修改待分析的字符串。那么如何一个线程安全的 strtok 呢？这就是线程私有数据的作用了。

   线程私有变量的使用场景就是：像全局变量一样使用,但是各个线程各部相同的变量.
   #+BEGIN_SRC c++ :tangle apue-notes/display-char.cc
#include <iostream>
#include <pthread.h>
#include <unistd.h>
const char *data;

char RetChar(const char *str) {
	if(str) {
		data = str;
	}
	return *data++;
}

void* ThreadFunc(void *arg) {
	char c = RetChar(static_cast<char*>(arg));
	while(c) {
		std::cout << c << std::endl;
		sleep(1);
		c = RetChar(NULL);
	}
	return NULL;
}
int main(int argc, char *argv[])
{
    pthread_t tid1, tid2;
	pthread_create(&tid1, NULL, ThreadFunc, const_cast<char*>("hello"));
	pthread_create(&tid2, NULL, ThreadFunc, const_cast<char*>("world"));
	pthread_join(tid1, NULL);
	pthread_join(tid2, NULL);

    return 0;
}

   #+END_SRC
   实现上面程序的线程安全版本
   #+BEGIN_SRC c++ :tangle apue-notes/display-char-r.cc
#include <iostream>
#include <pthread.h>
#include <unistd.h>

static pthread_key_t key;
static pthread_once_t initflag = PTHREAD_ONCE_INIT;

static void KeyInit(void) {
	pthread_key_create(&key, NULL);
}

char RetChar(const char *str) {
	pthread_once(&initflag, KeyInit);

	if(!pthread_getspecific(key)) {
		pthread_setspecific(key, str);
	}

	char *c = static_cast<char*>(pthread_getspecific(key));
	char rval = *c;
	pthread_setspecific(key, ++c);
	return rval;
}

void* ThreadFunc(void *arg) {
	char c = RetChar(static_cast<char*>(arg));
	while(c) {
		std::cout << c << std::endl;
		sleep(1);
		c = RetChar(NULL);
	}
	return NULL;
}
int main(int argc, char *argv[])
{
    pthread_t tid1, tid2;
	pthread_create(&tid1, NULL, ThreadFunc, const_cast<char*>("hello"));
	pthread_create(&tid2, NULL, ThreadFunc, const_cast<char*>("world"));
	pthread_join(tid1, NULL);
	pthread_join(tid2, NULL);

    return 0;
}

   #+END_SRC

** 12.7 取消选项

** 12.8 线程和信号
   每个线程都有自己的信号屏蔽字，但是信号的处理是进程中所有线程共享的。

   进程的信号是传递到单个线程的。
** 12.9 线程和 fork

   在子进程内部，只存在一个线程，它是 *由父进程中调用 fork 的线程的副本构成的* 。如果父进程中的线程占有锁，子进程将同样占有这些锁。子进程地址空间在创建时就得到了父进程定义的所有锁的副本。问题是 *子进程并不包含占有锁的那些线程的副本* ，所以子进程没有办法知道它占有了哪些锁、需要释放哪些锁。

   POSIX.1 声明，在 fork 返回和子进程调用其中一个 exec 函数之间，子进程只能调用异步信号安全的函数。

   L367:使用 ~pthread_atfork~ 来清除锁的状态。prepare 在 fork 前获得父进程所有的锁变量，这样 fork 的时候父子进程中所有锁的状态就是一致的。parent 在 fork 创建子进程后，返回之前在父进程上下文中定义，对所有锁进行解锁，child 在 fork 返回前在子进程上下文中对锁进行解锁。

   L368:那么这样看起来好像是父进程加锁一次，然后父子进程解锁两次。其实不是的，当父进程和子进程对它们的锁的副本解锁的死后哦，新的内存是分配给子进程的（写时复制），所以看起来执行序列应该是父加锁、子加锁、父解锁、子解锁。

   L368:可以多次调用 ~pthread_atfork~ 来设置多套 fork 处理程序。prepare 调用顺序与注册顺序相反，parent 和 child 按注册顺序调用。

   ~pthread_atfork~ 机制的意图是使 fork 之后的锁状态一致，但还是存在有限的情况，比如不能处理复杂的同步机制，不能处理递归锁等。

   最后总结：在多线程环境里面尽量不要使用 fork，或者 fork 之后立刻执行 exec 系列函数。

** 12.10 线程和 I/O
   使用 pread、pwrite 等原子操作来读写文件。

* 第十三章 守护进程
* 第十四章 高级 I/O
** 引言
** 非阻塞 I/O
** 记录锁
** I/O 多路转接
** 异步 I/O
** 函数 readv 和 writev
** 函数 readn 和 writen
** 存储映射 I/O
   L423:对指定映射存储区的保护要求不能超过文件 open 模式访问权限。映射存储区位于堆和栈之间：这属于实现袭击额，各种实现之间可能不同。

   L425:修改的页并不会立即写回到文件中。何时写回由内核的守护进程决定。
* 第十五章 进程间通信
