c/books/apue-notes.html
<div id="outline-container-org3da03a6" class="outline-3">
<h3 id="org3da03a6">12.6 线程特定数据</h3>
<div class="outline-text-3" id="text-org3da03a6">
<p>
为什么需要组织线程数据共享的接口呢？两个原因：
</p>
<ul class="org-ul">
<li>有时候需要维护基于每线程的数据，而不需要担心与其他线程的同步访问问题。</li>
<li><p>
提供了让基于进程的接口适应多线程环境的机制。
</p>

<p>
除了使用寄存器以外，一个线程没有办法阻止另一个线程访问它的数据。线程特定数据也不例外。虽然底层的实现部分并不能阻止这种访问能力，但管理线程特定数据的函数可以提高线程间的数据独立性，使得线程不太容易访问到其他线程的线程特定数据。
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;cstdio&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;cstring&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">str</span>[] = <span style="color: #ff4ea3;">"hello,this is a test string"</span>;
    <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">p</span> = strtok(str,<span style="color: #ff4ea3;">", "</span>);
    <span style="color: #a1db00;">while</span>(p) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; p &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        p = strtok(<span style="color: #5fafd7;">NULL</span>, <span style="color: #ff4ea3;">" "</span>);
    }
    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>

<p>
这里的 strtok 使用全局变量来保存要待分析的字符串，这是不是线程安全的。如果多线程同时使用这个函数会修改待分析的字符串。那么如何一个线程安全的 strtok 呢？这就是线程私有数据的作用了。
</p>

<p>
线程私有变量的使用场景就是：像全局变量一样使用,但是各个线程各部相同的变量.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;pthread.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>
<span style="color: #a1db00;">const</span> <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">data</span>;

<span style="color: #00d7af;">char</span> <span style="color: #ffd700;">RetChar</span>(<span style="color: #a1db00;">const</span> <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">str</span>) {
    <span style="color: #a1db00;">if</span>(str) {
        data = str;
    }
    <span style="color: #a1db00;">return</span> *data++;
}

<span style="color: #00d7af;">void</span>* <span style="color: #ffd700;">ThreadFunc</span>(<span style="color: #00d7af;">void</span> *<span style="color: #ff8700;">arg</span>) {
    <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">c</span> = RetChar(<span style="color: #a1db00;">static_cast</span>&lt;<span style="color: #00d7af;">char</span>*&gt;(arg));
    <span style="color: #a1db00;">while</span>(c) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; c &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        sleep(1);
        c = RetChar(<span style="color: #5fafd7;">NULL</span>);
    }
    <span style="color: #a1db00;">return</span> <span style="color: #5fafd7;">NULL</span>;
}
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #00d7af;">pthread_t</span> <span style="color: #ff8700;">tid1</span>, <span style="color: #ff8700;">tid2</span>;
    pthread_create(&amp;tid1, <span style="color: #5fafd7;">NULL</span>, ThreadFunc, <span style="color: #a1db00;">const_cast</span>&lt;<span style="color: #00d7af;">char</span>*&gt;(<span style="color: #ff4ea3;">"hello"</span>));
    pthread_create(&amp;tid2, <span style="color: #5fafd7;">NULL</span>, ThreadFunc, <span style="color: #a1db00;">const_cast</span>&lt;<span style="color: #00d7af;">char</span>*&gt;(<span style="color: #ff4ea3;">"world"</span>));
    pthread_join(tid1, <span style="color: #5fafd7;">NULL</span>);
    pthread_join(tid2, <span style="color: #5fafd7;">NULL</span>);

    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>
<p>
实现上面程序的线程安全版本
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;pthread.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">pthread_key_t</span> <span style="color: #ff8700;">key</span>;
<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">pthread_once_t</span> <span style="color: #ff8700;">initflag</span> = PTHREAD_ONCE_INIT;

<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">KeyInit</span>(<span style="color: #00d7af;">void</span>) {
    pthread_key_create(&amp;key, <span style="color: #5fafd7;">NULL</span>);
}

<span style="color: #00d7af;">char</span> <span style="color: #ffd700;">RetChar</span>(<span style="color: #a1db00;">const</span> <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">str</span>) {
    pthread_once(&amp;initflag, KeyInit);

    <span style="color: #a1db00;">if</span>(<span style="color: #ff4b4b;">!</span>pthread_getspecific(key)) {
        pthread_setspecific(key, str);
    }

    <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">c</span> = <span style="color: #a1db00;">static_cast</span>&lt;<span style="color: #00d7af;">char</span>*&gt;(pthread_getspecific(key));
    <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">rval</span> = *c;
    pthread_setspecific(key, ++c);
    <span style="color: #a1db00;">return</span> rval;
}

<span style="color: #00d7af;">void</span>* <span style="color: #ffd700;">ThreadFunc</span>(<span style="color: #00d7af;">void</span> *<span style="color: #ff8700;">arg</span>) {
    <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">c</span> = RetChar(<span style="color: #a1db00;">static_cast</span>&lt;<span style="color: #00d7af;">char</span>*&gt;(arg));
    <span style="color: #a1db00;">while</span>(c) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; c &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        sleep(1);
        c = RetChar(<span style="color: #5fafd7;">NULL</span>);
    }
    <span style="color: #a1db00;">return</span> <span style="color: #5fafd7;">NULL</span>;
}
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #00d7af;">pthread_t</span> <span style="color: #ff8700;">tid1</span>, <span style="color: #ff8700;">tid2</span>;
    pthread_create(&amp;tid1, <span style="color: #5fafd7;">NULL</span>, ThreadFunc, <span style="color: #a1db00;">const_cast</span>&lt;<span style="color: #00d7af;">char</span>*&gt;(<span style="color: #ff4ea3;">"hello"</span>));
    pthread_create(&amp;tid2, <span style="color: #5fafd7;">NULL</span>, ThreadFunc, <span style="color: #a1db00;">const_cast</span>&lt;<span style="color: #00d7af;">char</span>*&gt;(<span style="color: #ff4ea3;">"world"</span>));
    pthread_join(tid1, <span style="color: #5fafd7;">NULL</span>);
    pthread_join(tid2, <span style="color: #5fafd7;">NULL</span>);

    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org80d47f8" class="outline-3">
<h3 id="org80d47f8">12.7 取消选项</h3>
</div>

<div id="outline-container-orgd0cef35" class="outline-3">
<h3 id="orgd0cef35">12.8 线程和信号</h3>
<div class="outline-text-3" id="text-orgd0cef35">
<p>
每个线程都有自己的信号屏蔽字，但是信号的处理是进程中所有线程共享的。
</p>

<p>
进程的信号是传递到单个线程的。
</p>
</div>
</div>
<div id="outline-container-org29654b6" class="outline-3">
<h3 id="org29654b6">12.9 线程和 fork</h3>
<div class="outline-text-3" id="text-org29654b6">
<p>
在子进程内部，只存在一个线程，它是 <b>由父进程中调用 fork 的线程的副本构成的</b> 。如果父进程中的线程占有锁，子进程将同样占有这些锁。子进程地址空间在创建时就得到了父进程定义的所有锁的副本。问题是 <b>子进程并不包含占有锁的那些线程的副本</b> ，所以子进程没有办法知道它占有了哪些锁、需要释放哪些锁。
</p>

<p>
POSIX.1 声明，在 fork 返回和子进程调用其中一个 exec 函数之间，子进程只能调用异步信号安全的函数。
</p>

<p>
L367:使用 <code>pthread_atfork</code> 来清除锁的状态。prepare 在 fork 前获得父进程所有的锁变量，这样 fork 的时候父子进程中所有锁的状态就是一致的。parent 在 fork 创建子进程后，返回之前在父进程上下文中定义，对所有锁进行解锁，child 在 fork 返回前在子进程上下文中对锁进行解锁。
</p>

<p>
L368:那么这样看起来好像是父进程加锁一次，然后父子进程解锁两次。其实不是的，当父进程和子进程对它们的锁的副本解锁的死后哦，新的内存是分配给子进程的（写时复制），所以看起来执行序列应该是父加锁、子加锁、父解锁、子解锁。
</p>

<p>
L368:可以多次调用 <code>pthread_atfork</code> 来设置多套 fork 处理程序。prepare 调用顺序与注册顺序相反，parent 和 child 按注册顺序调用。
</p>
<div class="HTML">
<p>
&lt;script src="<a href="https://gist.github.com/phenix3443/a55b7bd260db4da66a8cd56d5b663b6e.js">https://gist.github.com/phenix3443/a55b7bd260db4da66a8cd56d5b663b6e.js</a>"&gt;&lt;/script&gt;
</p>

</div>
<p>
<code>pthread_atfork</code> 机制的意图是使 fork 之后的锁状态一致，但还是存在有限的情况，比如不能处理复杂的同步机制，不能处理递归锁等。
</p>

<p>
最后总结：在多线程环境里面尽量不要使用 fork，或者 fork 之后立刻执行 exec 系列函数。
</p>
</div>
</div>

<div id="outline-container-orgb5c5e0f" class="outline-3">
<h3 id="orgb5c5e0f">12.10 线程和 I/O</h3>
<div class="outline-text-3" id="text-orgb5c5e0f">
<p>
使用 pread、pwrite 等原子操作来读写文件。
</p>
</div>
</div>
</div>

<div id="outline-container-org175582a" class="outline-2">
<h2 id="org175582a">第十三章 守护进程</h2>
</div>
<div id="outline-container-orgb303825" class="outline-2">
<h2 id="orgb303825">第十四章 高级 I/O</h2>
<div class="outline-text-2" id="text-orgb303825">
</div>
<div id="outline-container-org1c8c087" class="outline-3">
<h3 id="org1c8c087">引言</h3>
</div>
<div id="outline-container-orge2bd903" class="outline-3">
<h3 id="orge2bd903">非阻塞 I/O</h3>
</div>
<div id="outline-container-org26af2c7" class="outline-3">
<h3 id="org26af2c7">记录锁</h3>
</div>
<div id="outline-container-org762a8fb" class="outline-3">
<h3 id="org762a8fb">I/O 多路转接</h3>
</div>
<div id="outline-container-orgc39f22d" class="outline-3">
<h3 id="orgc39f22d">异步 I/O</h3>
</div>
<div id="outline-container-org53dc29b" class="outline-3">
<h3 id="org53dc29b">函数 readv 和 writev</h3>
</div>
<div id="outline-container-org6c262d5" class="outline-3">
<h3 id="org6c262d5">函数 readn 和 writen</h3>
</div>
<div id="outline-container-orgf5cad40" class="outline-3">
<h3 id="orgf5cad40">存储映射 I/O</h3>
<div class="outline-text-3" id="text-orgf5cad40">
<p>
L423:对指定映射存储区的保护要求不能超过文件 open 模式访问权限。映射存储区位于堆和栈之间：这属于实现袭击额，各种实现之间可能不同。
</p>

<p>
L425:修改的页并不会立即写回到文件中。何时写回由内核的守护进程决定。
</p>
</div>
</div>
</div>
