content/c/books/apue-notes.org
** 管道
   管道的局限性：半双工和只能在具有公共祖先的两个进程间使用。
   #+BEGIN_SRC c++ :tangle apue-notes/fork-pipe.cc
#include <iostream>
#include <unistd.h>

int main(int argc, char *argv[])
{
    int fd[2];
	if (pipe(fd)) {
		std::cout << "create pipe error" << std::endl;
		return 1;
	}
	pid_t pid = fork();
	if (pid < 0) {
		std::cout << "fork error" << std::endl;
		return 1;
	}
	else if (pid > 0) {
		close(fd[0]);
		char msg[] = "hello,pipe!\n";
		write(fd[1], msg, sizeof(msg));
	}
	else {
		close(fd[1]);
		char msg[128] = {0};
		int n = read(fd[0], msg, sizeof(msg));
		write(STDOUT_FILENO, msg, n);
	}
    return 0;
}
L434: 无论何时调用 dup2 和 close 将一个描述符复制到另一个上，作为一种保护性的编程措施，都要现将两个描述符进行比较。
   #+END_SRC
** 函数 popen 和 pclose

** 协同进程

** FIFO

** XSI IPC
   每个内核中的 IPC 结构都使用一个非负整数的标识符加以引用。标识符是 IPC 对象的内部名，与每个 IPC 对象关联的 key 是其外部名。

   XSI IPC 有下列问题：
   + IPC 结构是在系统范围内起作用的，没有引用计数，释放不方便。
   + 这些 IPC 结构在文件系统中没有名字，不能使用常规的操作文件描述符的函数修改它们的属性。需要在内核中添加新的系统调用。

** 消息队列
   最后总结：在新的应用程序中不要使用消息队列。

** 信号量
   信号量是一个计数器，用于为多个进程提供对共享数据的访问。

   如果多个进程间共享一个资源，可以使用映射到两个进程地址空间中的信号量、记录锁或者互斥量。但是比较之下，最优的方法是使用文件锁。记录锁的性质确保当一个锁的持有者进程终止时，内核会自动释放该锁。不使用互斥量原因如下：首先，在多个进程间共享的内存中使用互斥量来恢复一个终止的进程更难。其次，进程共享的互斥量属性还没有得普遍支持。

** 共享存储
   共享存储快是因为数据不需要在进程间复制。
** POSIX 信号量

** 客户进程-服务器进程属性

* Footnotes

[fn:4] [[http://segmentfault.com/a/1190000000630435][关于在 Linux 下多个不相干的进程互斥访问同一片共享内存的问题]]

[fn:3] [[http://laoar.net/blogs/250/][三言两语聊 kernel：线程栈]]

[fn:2] [[http://blog.chinaunix.net/uid-28852942-id-3757186.html][线程同步: 条件变量的使用细节分析]]
