c/books/apue-notes.html
<div id="outline-container-orgf9e11fa" class="outline-2">
<h2 id="orgf9e11fa">第十五章 进程间通信</h2>
<div class="outline-text-2" id="text-orgf9e11fa">
</div>
<div id="outline-container-orga997df7" class="outline-3">
<h3 id="orga997df7">管道</h3>
<div class="outline-text-3" id="text-orga997df7">
<p>
管道的局限性：半双工和只能在具有公共祖先的两个进程间使用。
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">fd</span>[2];
    <span style="color: #a1db00;">if</span> (pipe(fd)) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"create pipe error"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        <span style="color: #a1db00;">return</span> 1;
    }
    <span style="color: #00d7af;">pid_t</span> <span style="color: #ff8700;">pid</span> = fork();
    <span style="color: #a1db00;">if</span> (pid &lt; 0) {
        <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"fork error"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
        <span style="color: #a1db00;">return</span> 1;
    }
    <span style="color: #a1db00;">else</span> <span style="color: #a1db00;">if</span> (pid &gt; 0) {
        close(fd[0]);
        <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">msg</span>[] = <span style="color: #ff4ea3;">"hello,pipe!\n"</span>;
        write(fd[1], msg, <span style="color: #a1db00;">sizeof</span>(msg));
    }
    <span style="color: #a1db00;">else</span> {
        close(fd[1]);
        <span style="color: #00d7af;">char</span> <span style="color: #ff8700;">msg</span>[128] = {0};
        <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">n</span> = read(fd[0], msg, <span style="color: #a1db00;">sizeof</span>(msg));
        write(STDOUT_FILENO, msg, n);
    }
    <span style="color: #a1db00;">return</span> 0;
}
<span style="color: #5fafd7;">L434</span>: &#26080;&#35770;&#20309;&#26102;&#35843;&#29992; dup2 &#21644; <span style="color: #00d7af;">close</span> <span style="color: #ff8700;">&#23558;&#19968;&#20010;&#25551;&#36848;&#31526;&#22797;&#21046;&#21040;&#21478;&#19968;&#20010;&#19978;</span>&#65292;&#20316;&#20026;&#19968;&#31181;&#20445;&#25252;&#24615;&#30340;&#32534;&#31243;&#25514;&#26045;&#65292;&#37117;&#35201;&#29616;&#23558;&#20004;&#20010;&#25551;&#36848;&#31526;&#36827;&#34892;&#27604;&#36739;&#12290;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc13ccc6" class="outline-3">
<h3 id="orgc13ccc6">函数 popen 和 pclose</h3>
</div>

<div id="outline-container-org9d04653" class="outline-3">
<h3 id="org9d04653">协同进程</h3>
</div>

<div id="outline-container-org3b5307d" class="outline-3">
<h3 id="org3b5307d">FIFO</h3>
</div>

<div id="outline-container-org57f68b9" class="outline-3">
<h3 id="org57f68b9">XSI IPC</h3>
<div class="outline-text-3" id="text-org57f68b9">
<p>
每个内核中的 IPC 结构都使用一个非负整数的标识符加以引用。标识符是 IPC 对象的内部名，与每个 IPC 对象关联的 key 是其外部名。
</p>

<p>
XSI IPC 有下列问题：
</p>
<ul class="org-ul">
<li>IPC 结构是在系统范围内起作用的，没有引用计数，释放不方便。</li>
<li>这些 IPC 结构在文件系统中没有名字，不能使用常规的操作文件描述符的函数修改它们的属性。需要在内核中添加新的系统调用。</li>
</ul>
</div>
</div>

<div id="outline-container-orgee1e7c6" class="outline-3">
<h3 id="orgee1e7c6">消息队列</h3>
<div class="outline-text-3" id="text-orgee1e7c6">
<p>
最后总结：在新的应用程序中不要使用消息队列。
</p>
</div>
</div>

<div id="outline-container-orgcea994e" class="outline-3">
<h3 id="orgcea994e">信号量</h3>
<div class="outline-text-3" id="text-orgcea994e">
<p>
信号量是一个计数器，用于为多个进程提供对共享数据的访问。
</p>

<p>
如果多个进程间共享一个资源，可以使用映射到两个进程地址空间中的信号量、记录锁或者互斥量。但是比较之下，最优的方法是使用文件锁。记录锁的性质确保当一个锁的持有者进程终止时，内核会自动释放该锁。不使用互斥量原因如下：首先，在多个进程间共享的内存中使用互斥量来恢复一个终止的进程更难。其次，进程共享的互斥量属性还没有得普遍支持。
</p>
</div>
</div>

<div id="outline-container-org7f23a6f" class="outline-3">
<h3 id="org7f23a6f">共享存储</h3>
<div class="outline-text-3" id="text-org7f23a6f">
<p>
共享存储快是因为数据不需要在进程间复制。
</p>
</div>
</div>
<div id="outline-container-org05b06f7" class="outline-3">
<h3 id="org05b06f7">POSIX 信号量</h3>
</div>

<div id="outline-container-org3a36a38" class="outline-3">
<h3 id="org3a36a38">客户进程-服务器进程属性</h3>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://segmentfault.com/a/1190000000630435">关于在 Linux 下多个不相干的进程互斥访问同一片共享内存的问题</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-25 三 16:17</p>
<p class="validation"></p>
</div>
</body>
</html>
